Repository: KDE/smb4k
Catalog: po/sa/smb4k-core.po
Languages: sa

# default profile name for use at home
source: Home
sa: गृहम्‌

# default profile name for use at work
source: Work
sa: कार्यम्‌

source: Tab orientation:
sa: ट्याब् अभिविन्यासः :

source: Set the tab orientation for the tabified dock widgets.
sa: ट्याब्ड् डॉक् विजेट् कृते ट्याब् अभिमुखीकरणं सेट् कुर्वन्तु ।

source: Top
sa: उपरितन

source: Bottom
sa: अधः

source: Left
sa: वामः

source: Right
sa: दक्षिणः

source: Show custom bookmark label if available
sa: यदि उपलब्धं भवति तर्हि कस्टम् बुकमार्क लेबलं दर्शयन्तु

source: Do not show the name of the bookmarked share, but the custom label that was defined in the bookmark editor.
sa: बुकमार्ककृतस्य भागस्य नाम न दर्शयन्तु, अपितु बुकमार्कसम्पादके परिभाषितं कस्टम् लेबलं दर्शयन्तु ।

source: Start docked
sa: डॉक् कृत्वा आरभत

source: Start the application docked to the system tray, i.e. only the system tray widget is shown and the main window is hidden. You can bring the main window up by clicking on the system tray widget or by choosing "Restore" from its popup menu.
sa: सिस्टम् ट्रे मध्ये डॉक् कृतं अनुप्रयोगं आरभत, अर्थात् केवलं सिस्टम् ट्रे विजेट् दर्शितं मुख्यविण्डो च गुप्तं भवति । भवान् मुख्यविण्डो उपरि आनेतुं शक्नोति system tray widget इत्यत्र क्लिक् कृत्वा अथवा तस्य popup menu तः "Restore" इति चित्वा ।

source: Show the type of the share
sa: भागस्य प्रकारं दर्शयतु

source: The type of a share will be displayed in a separate column in the network neighborhood browser. It can either be Disk, Printer or IPC.
sa: जालपरिसरस्य ब्राउजरे पृथक् स्तम्भे भागस्य प्रकारः प्रदर्शितः भविष्यति । इदं Disk, Printer अथवा IPC भवितुम् अर्हति ।

source: Show the IP address of the server
sa: सर्वरस्य IP-सङ्केतं दर्शयतु

source: The IP address of the server will be displayed in a separate column in the network neighborhood browser.
sa: सर्वरस्य IP-सङ्केतः नेटवर्क्-परिसर-ब्राउजर्-मध्ये पृथक् स्तम्भे प्रदर्शितं भविष्यति ।

source: Show the comment
sa: टिप्पणीं दर्शयतु

source: The comment describing the server or share will be displayed in a separate column in the network neighborhood browser.
sa: सर्वरस्य अथवा भागस्य वर्णनं कृत्वा टिप्पणी जालपरिसरस्य ब्राउजर् मध्ये पृथक् स्तम्भे प्रदर्शिता भविष्यति ।

source: Show tooltips for network items
sa: संजालवस्तूनाम् कृते साधनसूचनानि दर्शयतु

source: The tooltip shows various information about the current network item.
sa: टूलटिप् वर्तमानजालवस्तुविषये विविधाः सूचनाः दर्शयति ।

source: Automatically expand domains and hosts
sa: स्वयमेव डोमेन्स्, होस्ट् च विस्तारयन्तु

source: Automatically expand domain and host items when a list of associated network items (domain members or shares) is added or updated. Please note that a domain or host item will always be expanded when you execute it.
sa: यदा सम्बद्धानां संजालवस्तूनाम् (डोमेन सदस्यानां वा भागानां) सूची योजितं वा अद्यतनं वा भवति तदा स्वयमेव डोमेन-होस्ट्-वस्तूनाम् विस्तारं कुर्वन्तु । कृपया ज्ञातव्यं यत् डोमेन् अथवा होस्ट्-वस्तु सर्वदा विस्तारितः भविष्यति यदा भवान् तत् निष्पादयति ।

source: Show tooltips for mounted shares
sa: माउण्ट्-कृत-शेयर-कृते टूल्टिप्स् दर्शयतु

source: The tooltip shows various information about the current share.
sa: टूलटिप् वर्तमानभागस्य विषये विविधाः सूचनाः दर्शयति ।

source: View mode:
sa: दृश्यविधिः :

source: This setting determines the view mode of the shares view. There are two modes: the icon view and the list view.
sa: एतत् सेटिङ्ग् shares view इत्यस्य view mode निर्धारयति । तत्र द्वौ मोडौ स्तः : चिह्नदृश्यं सूचीदृश्यं च ।

source: Icon View
sa: चिह्नदृश्यम्

source: List View
sa: सूचीदृश्यम्

source: Icon size for the icon view:
sa: चिह्नदृश्यस्य कृते चिह्नस्य आकारः :

source: Set the icon size for the icon view mode of the shares view.
sa: shares view इत्यस्य icon view mode इत्यस्य कृते icon size सेट् कुर्वन्तु ।

source: Icon size for the list view:
sa: सूचीदृश्यस्य कृते चिह्नस्य आकारः :

source: Set the icon size for the list view mode of the shares view.
sa: shares view इत्यस्य list view mode इत्यस्य कृते icon size सेट् कुर्वन्तु ।

source: Icon size:
sa: चिह्नस्य आकारः :

source: Set the icon size for the network neighborhood browser.
sa: संजालपरिसरस्य ब्राउजर् कृते चिह्नस्य आकारं सेट् कुर्वन्तु ।

source: Use Web Services Dynamic Discovery (WS-Discovery) for browsing
sa: ब्राउजिंग् कृते Web Services Dynamic Discovery (WS-Discovery) इत्यस्य उपयोगं कुर्वन्तु

source: The Web Services Dynamic Discovery (WS-Discovery) is used to browse the local network and discover workgroups, domains and hosts. This is useful, if your network neighborhood is dominated by servers with modern Windows versions. If you use this option, there should be no need to force Samba's client library to use the SMB protocol version 1.0 for searching for workgroups and domains.
sa: Web Services Dynamic Discovery (WS-Discovery) इत्यस्य उपयोगः स्थानीयजालस्य ब्राउज् कर्तुं कार्यसमूहान्, डोमेन्, होस्ट् च अन्वेष्टुं भवति । एतत् उपयोगी भवति, यदि भवतः संजालस्य परिसरे आधुनिकविण्डोजसंस्करणयुक्तैः सर्वरैः आधिपत्यं भवति । यदि भवान् एतत् विकल्पं उपयुङ्क्ते तर्हि कार्यसमूहानां डोमेनानां च अन्वेषणार्थं SMB प्रोटोकॉलसंस्करणं 1.0 उपयोक्तुं Samba इत्यस्य क्लायन्ट् पुस्तकालयं बाध्यं कर्तुं आवश्यकता नास्ति ।

source: Use DNS Service Discovery (DNS-SD) for browsing
sa: ब्राउजिंग् कृते DNS Service Discovery (DNS-SD) इत्यस्य उपयोगं कुर्वन्तु

source: The DNS Service Discovery (DNS-SD) is used to browse the local network and discover servers that provide shared SMB resources. The discovered domains correspond to the local DNS domains (e. g. named LOCAL) and most likely not the ones defined in the network neighborhood. However, this does not influence the browsing. If you use this option, there is no need to force Samba's client library to use the SMB protocol version 1.0 for searching for workgroups and domains.
sa: DNS Service Discovery (DNS-SD) इत्यस्य उपयोगः स्थानीयजालस्य ब्राउज् कर्तुं तथा च साझा SMB संसाधनं प्रदातुं सर्वराणां आविष्कारार्थं भवति । आविष्कृताः डोमेनाः स्थानीय-DNS-क्षेत्रेभ्यः (उदा. LOCAL इति नाम) अनुरूपाः सन्ति तथा च अधिकतया संजाल-परिसर-मध्ये परिभाषित-क्षेत्रेषु न । परन्तु एतेन ब्राउजिंग् इत्यस्य प्रभावः न भवति । यदि भवान् एतत् विकल्पं उपयुङ्क्ते तर्हि कार्यसमूहानां डोमेनानां च अन्वेषणार्थं SMB प्रोटोकॉलसंस्करणं 1.0 उपयोक्तुं Samba इत्यस्य क्लायन्ट् पुस्तकालयं बाध्यं कर्तुं आवश्यकता नास्ति ।

source: Set minimal and maximal SMB protocol version
sa: न्यूनतमं अधिकतमं च SMB प्रोटोकॉलसंस्करणं सेट् कुर्वन्तु

source: Smb4K will set the minimal and maximal SMB protocol version that is used by Samba's client library to browse the network neighborhood. This will overwrite the settings in the smb.conf file. Normally, you do not need to use this option, because the right protocol versions should be negotiated between the client and the server while establishing a connection. Please note that this setting might not be appropriate to make the discovering of workgroups and domains work while keeping undisturbed connectivity to servers. Use DNS Service Discovery (DNS-SD) or Web Services Dynamic Discovery (WS-Discovery) for domain and workgroup lookups instead.
sa: Smb4K न्यूनतमं अधिकतमं च SMB प्रोटोकॉलसंस्करणं सेट् करिष्यति यत् Samba इत्यस्य क्लायन्ट् पुस्तकालयेन संजालपरिसरं ब्राउज् कर्तुं उपयुज्यते । एतेन smb.conf सञ्चिकायां सेटिङ्ग्स् अधिलेखनं भविष्यति । सामान्यतया, भवद्भिः एतस्य विकल्पस्य उपयोगस्य आवश्यकता नास्ति, यतः संयोजनं स्थापयन् क्लायन्ट्-सर्वरयोः मध्ये समीचीनप्रोटोकॉल-संस्करणानाम् वार्तालापः करणीयः । कृपया ज्ञातव्यं यत् सर्वरेषु अविक्षिप्तसंयोजनं स्थापयन् कार्यसमूहानां डोमेनानां च आविष्कारं कार्यं कर्तुं एषा सेटिङ्ग् उचितं न भवेत् । तस्य स्थाने डोमेन् तथा कार्यसमूहस्य लुकअप् कृते DNS Service Discovery (DNS-SD) अथवा Web Services Dynamic Discovery (WS-Discovery) इत्यस्य उपयोगं कुर्वन्तु ।

source: Minimal SMB protocol version:
sa: न्यूनतमं SMB प्रोटोकॉलसंस्करणम् :

source: This setting controls the minimum protocol version that Samba's client library will attempt to use.
sa: एषा सेटिङ्ग् न्यूनतमं प्रोटोकॉलसंस्करणं नियन्त्रयति यत् साम्बा इत्यस्य क्लायन्ट् पुस्तकालयः उपयोक्तुं प्रयतते ।

source: NT1 (Classic CIFS/SMBv1 protocol)
sa: NT1 (क्लासिक CIFS/SMBv1 प्रोटोकॉल) 1.1.

source: SMB2 (Windows Vista and above)
sa: SMB2 (विण्डोज विस्टा अपि च उपरि)

source: SMB3 (Windows 8 and above)
sa: SMB3 (विण्डोज ८ अपि च उपरि)

source: Maximal SMB protocol version:
sa: अधिकतमं SMB प्रोटोकॉलसंस्करणम् :

source: This setting controls the maximum protocol version that Samba's client library will attempt to use.
sa: एषा सेटिङ्ग् अधिकतमं प्रोटोकॉलसंस्करणं नियन्त्रयति यत् साम्बा इत्यस्य क्लायन्ट् पुस्तकालयः उपयोक्तुं प्रयतते ।

source: Set the SMB port to:
sa: SMB पोर्ट् इत्येतत् सेट् कुर्वन्तु:

source: This is the port that is used for connecting to remote servers. The default value is 139 (NetBIOS). Under FreeBSD, this setting is also used for mounting.
sa: एतत् पोर्ट् अस्ति यत् दूरस्थसर्वर-सम्बद्धानां कृते उपयुज्यते । पूर्वनिर्धारितं मूल्यं १३९ (NetBIOS) अस्ति । FreeBSD इत्यस्य अधः एतत् सेटिङ्ग् माउण्ट् कर्तुं अपि उपयुज्यते ।

source: This computer is on a large network neighborhood
sa: अयं सङ्गणकः विशाले जालपरिसरस्य उपरि अस्ति

source: In case your computer is on a large network neighborhood, discovering all workgroups, hosts and shares might take a long time, since in the default configuration all local master browsers are queried. Enabling this setting limits the number of used local master browsers to three. This can reduced the time consumption on large network neighborhoods considerably.
sa: यदि भवतः सङ्गणकः विशाले जालपरिसरस्य उपरि अस्ति तर्हि सर्वेषां कार्यसमूहानां, होस्ट्-साझेदारानाम् आविष्काराय दीर्घकालं यावत् समयः भवितुं शक्नोति, यतः पूर्वनिर्धारित-विन्यासे सर्वे स्थानीय-मास्टर-ब्राउजर्-पृष्टाः भवन्ति एतत् सेटिङ्ग् सक्षमीकरणेन प्रयुक्तानां स्थानीयमास्टरब्राउजराणां संख्या त्रीणि यावत् सीमितं भवति । एतेन बृहत्जालपरिसरस्य समयस्य उपभोगः बहुधा न्यूनीकर्तुं शक्यते ।

source: Master browsers require authentication
sa: मास्टर ब्राउजर् कृते प्रमाणीकरणस्य आवश्यकता भवति

source: The master browsers in your network neighborhood require a login to return the browse list. This setting is rarely needed.
sa: भवतः जालपरिसरस्य मुख्यब्राउजर् ब्राउज्सूचीं प्रत्यागन्तुं प्रवेशस्य आवश्यकता भवति । एतस्य सेटिंग् इत्यस्य आवश्यकता दुर्लभा एव भवति ।

source: Use Kerberos for authentication
sa: प्रमाणीकरणार्थं Kerberos इत्यस्य उपयोगं कुर्वन्तु

source: Use Kerberos for authentication. This is only useful in an Active Directory environment.
sa: प्रमाणीकरणार्थं Kerberos इत्यस्य उपयोगं कुर्वन्तु । एतत् केवलं Active Directory वातावरणे एव उपयोगी भवति ।

source: Use Winbind ccache for authentication
sa: प्रमाणीकरणार्थं Winbind ccache इत्यस्य उपयोगं कुर्वन्तु

source: Use the Winbind ccache for authentication.
sa: प्रमाणीकरणार्थं Winbind ccache इत्यस्य उपयोगं कुर्वन्तु ।

source: Set the encryption level to:
sa: एन्क्रिप्शनस्तरं सेट् कुर्वन्तु:

source: Set the level of encryption that is used for making connections.
sa: संयोजनानि कर्तुं यत् एन्क्रिप्शनस्य स्तरं उपयुज्यते तत् सेट् कुर्वन्तु ।

source: None
sa: न कश्चित्

source: Request
sa: अनुरोधः

source: Require
sa: आवश्यक

source: Preview hidden files and directories
sa: गुप्तसञ्चिकानां निर्देशिकानां च पूर्वावलोकनं कुर्वन्तु

source: Preview hidden files and directories. The hidden files and directories are those whose names begin with a period. They are usually needed for very specific purposes (storing the configuration information for an application, etc.). Since they are not of any importance for your regular work, you normally do not need to enable this feature.
sa: गुप्तसञ्चिकानां निर्देशिकानां च पूर्वावलोकनं कुर्वन्तु। गुप्तसञ्चिकाः निर्देशिकाः च ताः सन्ति येषां नाम अवधिना आरभ्यते । प्रायः तेषां आवश्यकता अत्यन्तं विशिष्टप्रयोजनार्थं (अनुप्रयोगस्य कृते विन्याससूचनायाः संग्रहणम् इत्यादि) भवति । यतः भवतः नियमितकार्यस्य कृते तेषां महत्त्वं नास्ति, सामान्यतया भवता एतत् विशेषता सक्षमीकरणस्य आवश्यकता नास्ति ।

source: Detect printer shares
sa: मुद्रकसाझेदारीम् अन्वेष्टुम्

source: Printer shares are detected.
sa: मुद्रकस्य भागाः ज्ञायन्ते ।

source: Detect hidden shares
sa: गुप्तभागानाम् अन्वेषणं कुर्वन्तु

source: Hidden shares are detected. Hidden shares are ending with a $ sign, e.g. Musik$ or IPC$.
sa: गुप्तभागाः ज्ञायन्ते। गुप्तभागाः $ चिह्नेन समाप्ताः भवन्ति, उदा. Musik$ अथवा IPC$।

source: Enable Wake-On-LAN features
sa: Wake-On-LAN विशेषताः सक्षमाः कुर्वन्तु

source: Wake-on-LAN (WOL) is an ethernet computer networking standard that allows a computer to be turned on or woken up by a network message. Smb4K uses a magic packet send via a UDP socket to wake up remote servers. If you want to take advantage of the Wake-On-LAN feature, you need to enable this option.
sa: Wake-on-LAN (WOL) इति ईथरनेट् सङ्गणकसंजालमानकम् अस्ति यत् सङ्गणकं जालसन्देशेन चालू कर्तुं वा जागृतुं वा शक्नोति । Smb4K दूरस्थसर्वरं जागृतुं UDP सॉकेट् मार्गेण प्रेषितं जादुपैकेट् उपयुज्यते । यदि भवान् Wake-On-LAN इति सुविधायाः लाभं ग्रहीतुं इच्छति तर्हि भवान् एतत् विकल्पं सक्षमं कर्तव्यम् ।

source: Waiting time:
sa: प्रतीक्षासमयः :

source: This is the waiting time in seconds between the sending of the magic Wake-On-LAN packets and the scanning of the network neighborhood or the mounting of a share.
sa: एषः जादुई Wake-On-LAN-पैकेट्-प्रेषणस्य च संजाल-परिसरस्य स्कैनिङ्गस्य अथवा भागस्य माउण्टिङ्ग्-योः मध्ये सेकण्ड्-मात्रायां प्रतीक्षासमयः अस्ति

source: Synchronization prefix:
sa: समन्वयन उपसर्गः :

source: Under this prefix the destination directory for the synchronization will be created. However, if you want to store the data of a particular share elsewhere, you will be able to choose a different path before the actual synchronization begins.
sa: अस्य उपसर्गस्य अधः समन्वयनार्थं गन्तव्यनिर्देशिका निर्मीयते । परन्तु यदि भवान् अन्यत्र कस्यचित् भागविशेषस्य दत्तांशं संग्रहीतुं इच्छति तर्हि वास्तविकसमन्वयनस्य आरम्भात् पूर्वं भिन्नमार्गं चिन्वितुं शक्नोति ।

source: Archive mode
sa: संग्रहणविधिः

source: Use archive mode (-a, --archive). This is a short form of -rlptgoD.
sa: संग्रहविधिः (-a, --archive) उपयुज्यताम् । एतत् -rlptgoD इत्यस्य लघुरूपम् अस्ति ।

source: Recurse into subdirectories
sa: उपनिर्देशिकासु पुनः गमनम्

source: Recurse into directories (-r, --recursive).
sa: निर्देशिकासु पुनरावृत्तिः (-r, --recursive) ।

source: Update files
sa: सञ्चिकाः अद्यतनं कुर्वन्तु

source: Update files in the destination directory that are older than in the source directory (-u, --update).
sa: गन्तव्यनिर्देशिकायां सञ्चिकाः अद्यतनं कुर्वन्तु ये स्रोतनिर्देशिकायां (-u, --update) अपेक्षया प्राचीनाः सन्ति ।

source: Update files in place
sa: स्थाने सञ्चिकाः अद्यतनं कुर्वन्तु

source: Update destination files in-place (--inplace). By default, rsync first creates a new copy of a file and moves it into place after its transfer finished. If you enable this feature, no copy will be created but the destination file will immediately be overwritten instead. An exception to this is if you combine this option with --backup.
sa: गन्तव्यसञ्चिकाः स्थाने (--inplace) अद्यतनं कुर्वन्तु । पूर्वनिर्धारितरूपेण rsync प्रथमं सञ्चिकायाः नूतनं प्रतिलिपिं निर्माय तस्याः स्थानान्तरणं समाप्तं कृत्वा स्थाने स्थानान्तरयति । यदि भवान् एतत् विशेषतां सक्षमं करोति तर्हि कोऽपि प्रतिलिपिः न निर्मीयते किन्तु गन्तव्यसञ्चिका तत्क्षणमेव तस्य स्थाने अधिलिखिता भविष्यति । अस्य अपवादः अस्ति यदि भवान् एतत् विकल्पं --backup इत्यनेन सह संयोजयति ।

source: Use relative path names
sa: सापेक्षमार्गनामानां प्रयोगं कुर्वन्तु

source: Use relative paths (-R, --relative). This means that the full path names specified on the command line are sent to the server rather than just the last parts of the file names.
sa: सापेक्षमार्गाणां प्रयोगं कुर्वन्तु (-R, --relative)। अस्य अर्थः अस्ति यत् आदेशपङ्क्तौ निर्दिष्टानि पूर्णमार्गनामानि केवलं सञ्चिकानामानां अन्तिमभागानाम् अपेक्षया सर्वरं प्रति प्रेष्यन्ते ।

source: Do not send implied directories
sa: अन्तर्निहितनिर्देशिकाः न प्रेषयन्तु

source: Do not send implied directories with --relative (--no-implied-dirs). This means that the corresponding path elements on the destination system are left unchanged if they exist, and any missing implied directories are created with default attributes. This even allows these implied path elements to have big differences, such as being a symlink to a directory on one side of the transfer, and a real directory on the other side.
sa: --relative (--no-implied-dirs) इत्यनेन सह अन्तर्निहितनिर्देशिकाः न प्रेषयन्तु । अस्य अर्थः अस्ति यत् गन्तव्यतन्त्रे तत्सम्बद्धाः मार्गतत्त्वानि यदि सन्ति तर्हि अपरिवर्तिताः त्यजन्ति, तथा च यत्किमपि लुप्तं अन्तर्निहितनिर्देशिका पूर्वनिर्धारितगुणैः सह निर्मितं भवति एतेन एतेषां निहितमार्गतत्त्वानां महत् भेदः अपि भवति, यथा स्थानान्तरणस्य एकस्मिन् पार्श्वे निर्देशिकायाः प्रतीकसम्बद्धता, अपरपार्श्वे च वास्तविकनिर्देशिका

source: Transfer directories without recursing
sa: पुनरावृत्तिं विना निर्देशिकाः स्थानान्तरयन्तु

source: Transfer directories without recursing (-d, --dirs). This means that all top-level subdirectories are transferred but without their contents.
sa: पुनरावृत्ति (-d, --dirs) विना निर्देशिकाः स्थानान्तरयन्तु । अस्य अर्थः अस्ति यत् सर्वाणि शीर्षस्तरीयाः उपनिर्देशिकाः स्थानान्तरिताः भवन्ति परन्तु तेषां सामग्रीं विना ।

source: Compress data during transfer
sa: स्थानान्तरणस्य समये आँकडानां संपीडनं कुर्वन्तु

source: Compress data during transfer (-z, --compress). This significantly reduces the amount of data that is being transferred. You may want to use this option, if you have a slow connection.
sa: स्थानान्तरणस्य समये आँकडानां संपीडनं कुर्वन्तु (-z, --compress)। एतेन स्थानान्तरितस्य दत्तांशस्य परिमाणं महत्त्वपूर्णतया न्यूनीकरोति । भवान् एतत् विकल्पं उपयोक्तुं इच्छति, यदि भवतां मन्दसम्बन्धः अस्ति ।

source: Set compression level:
sa: संपीडनस्तरं सेट् कुर्वन्तु :

source: Explicitly set the compression level to use (--compress-level=NUM). If NUM is non-zero, the --compress argument is implied.
sa: स्पष्टतया उपयोगाय संपीडनस्तरं सेट् कुर्वन्तु (--compress-level=NUM) । यदि NUM शून्यरहितः अस्ति तर्हि --compress तर्कः अभिप्रेतः अस्ति ।

source: The value for the UseCompressionLevel config entry
sa: UseCompressionLevel विन्यासप्रविष्टेः मूल्यम्

source: Skip compression for following file suffixes:
sa: निम्नलिखितसञ्चिकाप्रत्ययानां कृते संपीडनं त्यजन्तु:

source: Overwrite the list of file suffixes that will not be compressed (--skip-compress=LIST). The LIST should be one or more file suffixes (without the dot) separated by slashes. You may specify an empty string to indicate that no file should be skipped. The default list of suffixes will be replaced by this list. For further details, see the manual page of rsync.
sa: सञ्चिकाप्रत्ययानां सूचीं अधिलिखन्तु ये संपीडिताः न भविष्यन्ति (--skip-compress=LIST) । LIST एकः वा अधिकः सञ्चिकाप्रत्ययः (बिन्दुरहितः) स्लैशैः पृथक् भवितुमर्हति । कोऽपि सञ्चिका न त्यक्तव्या इति सूचयितुं भवान् रिक्तं स्ट्रिंग् निर्दिष्टुं शक्नोति । प्रत्ययानां पूर्वनिर्धारितसूची अस्याः सूचीयाः स्थाने स्थापिता भविष्यति । अधिकविवरणार्थं rsync इत्यस्य मैनुअल् पृष्ठं पश्यन्तु ।

source: The value(s) for the UseSkipCompression config entry
sa: UseSkipCompression विन्यासप्रविष्टेः मूल्यं (मूल्यानि)

source: Preserve symlinks
sa: प्रतीकसम्बद्धानि संरक्षितानि कुर्वन्तु

source: Copy symlinks as symlinks (-l, --links).
sa: सिम्लिङ्क्स् सिम्लिङ्क्स् (-l, --links) इति प्रतिलिपिं कुर्वन्तु ।

source: Transform symlinks
sa: प्रतीकलिङ्कानां परिवर्तनं कुर्वन्तु

source: Transform symlinks into the items they are pointing to (-L, --copy-links).
sa: सिम्लिङ्क्स् तान् सूचयन्तः वस्तूनि (-L, --copy-links) परिणमयन्तु ।

source: Transform unsafe symlinks
sa: असुरक्षितचिह्नलिङ्कानां परिवर्तनं कुर्वन्तु

source: Transform unsafe symlinks into the items they are pointing to (--copy-unsafe-links). This means that only those symlinks are transformed that point to items that are outside the copied tree. Absolute symlinks are treated the same way. This option has no additional effect if --copy-links has also been specified.
sa: असुरक्षितचिह्नलिङ्कानि तेषां सूचकाः वस्तूनि (--copy-unsafe-links) परिणमयन्तु । अस्य अर्थः अस्ति यत् केवलं ते लक्षणसम्बद्धाः परिणताः भवन्ति ये प्रतिलिपिकृतवृक्षात् बहिः सन्ति वस्तूनि दर्शयन्ति । निरपेक्षलक्षणसम्बद्धानां व्यवहारः अपि तथैव भवति । यदि --copy-links अपि निर्दिष्टम् अस्ति तर्हि अस्य विकल्पस्य अतिरिक्तः प्रभावः नास्ति ।

source: Ignore unsafe symlinks
sa: असुरक्षितचिह्नलिङ्कानां अवहेलनां कुर्वन्तु

source: Ignore symlinks that point outside the copied tree (--safe-links). All absolute symlinks are also ignored. If you use this option in conjunction with --relative you might get unexpected results.
sa: प्रतिलिपिकृतवृक्षस्य (--safe-links) बहिः सूचयन्ति इति लक्षणसम्बद्धानि अवहेलयन्तु । सर्वे निरपेक्षचिह्नसम्बद्धाः अपि उपेक्षिताः भवन्ति । यदि भवान् --relative इत्यनेन सह एतत् विकल्पं उपयुङ्क्ते तर्हि भवान् अप्रत्याशितफलं प्राप्नुयात् ।

source: Munge symlinks
sa: मुंगे सिम्लिङ्क्

source: This option tells rsync to (1) modify all symlinks on the receiving side in a way that makes them unusable but recoverable, or (2) to unmunge symlinks on the sending side that had been stored in a munged state (--munge-links). This is useful if you do not quite trust the source of the data to not try to slip in a symlink to an unexpected place. For more details, see the manual page of rsync.
sa: एषः विकल्पः rsync इत्यस्मै कथयति यत् (1) ग्राहकपक्षे सर्वाणि प्रतीकसम्बद्धानि परिवर्तनीयानि येन ते अनुपयोग्याः परन्तु पुनः प्राप्तुं शक्यन्ते, अथवा (2) प्रेषकपक्षे प्रतीकलिङ्कानि अनमुन्ज् कर्तुं यत् munged अवस्थायां (--munge-links) संगृहीतम् आसीत् ). यदि भवान् दत्तांशस्य स्रोतः अप्रत्याशितस्थानं प्रति सिम्लिङ्क् स्खलितुं न प्रयतते इति सम्यक् न विश्वसिति तर्हि एतत् उपयोगी भवति । अधिकविवरणार्थं rsync इत्यस्य मैनुअल् पृष्ठं पश्यन्तु ।

source: Preserve hard links
sa: कठिनलिङ्कानि संरक्षितानि

source: Preserve hard links (-H, --hard-links). This options causes rsync to preserve the hard links that are found during the transfer. Without it, hard links are treated as though they were separate files.
sa: कठिनलिङ्कानि (-H, --hard-links) संरक्षितानि । एतेन विकल्पाः rsync इत्यस्य कारणं भवति यत् स्थानान्तरणस्य समये दृश्यमानानि हार्डलिङ्कानि संरक्षितानि भवन्ति । तद्विना हार्डलिङ्क्स् पृथक् सञ्चिकाः इव व्यवह्रियन्ते ।

source: Copy directory symlinks
sa: निर्देशिकाचिह्नलिङ्कानि प्रतिलिख्यताम्

source: Treat symlinks to directories on the sending side as though they were real ones (-k, --copy-dirlinks). This is useful if you do not want symlinks to non-directories to be affected, as they would be using --copy-links. Without this option, if the sending side has replaced a directory with a symlink to a directory, the receiving side will delete anything that is in the way of the new symlink, including a directory hierarchy (as long as --force or --delete is in effect). For more details, see the manual page of rsync.
sa: प्रेषकपक्षे निर्देशिकासु प्रतीकसम्बद्धान् वास्तविकरूपेण (-k, --copy-dirlinks) व्यवहारं कुर्वन्तु । यदि भवान् अनिर्देशिकानां प्रतीकसम्बद्धानां प्रभावं न इच्छति तर्हि एतत् उपयोगी भवति, यतः ते --copy-links इत्यस्य उपयोगं करिष्यन्ति । एतत् विकल्पं विना यदि प्रेषकपक्षेण निर्देशिकायाः स्थाने निर्देशिकायाः प्रतीकलिङ्कः स्थापितः अस्ति तर्हि ग्राहकपक्षः नूतनचिह्नसम्बद्धस्य मार्गे यत्किमपि अस्ति तत् निर्देशिकापदानुक्रमं (यावत् --force अथवा --delete) सहितं विलोपयिष्यति इति प्रभावे) । अधिकविवरणार्थं rsync इत्यस्य मैनुअल् पृष्ठं पश्यन्तु ।

source: Keep directory symlinks
sa: निर्देशिकाचिह्नलिङ्कानि स्थापयन्तु

source: Treat symlinks to directories on the receiving side as though they were real ones (-K, --keep-dirlinks). This only works if the symlink matches a real directory from the sending side. Without this option, the receiver's symlink will be deleted and replaced with a real directory.
sa: ग्राहकपक्षे निर्देशिकासु प्रतीकसम्बद्धान् वास्तविकरूपेण (-K, --keep-dirlinks) व्यवहारं कुर्वन्तु । एतत् केवलं तदा एव कार्यं करोति यदा सिम्लिङ्क् प्रेषकपक्षतः वास्तविकनिर्देशिकायाः मेलनं करोति । एतत् विकल्पं विना ग्राहकस्य सिम्लिङ्क् विलोपितं भविष्यति, तस्य स्थाने वास्तविकनिर्देशिका स्थापिता भविष्यति ।

source: Preserve permissions
sa: अनुमतिः संरक्षितुम्
