Repository: KDE/smb4k
Catalog: po/sa/smb4k-core.po
Languages: sa

source: Preserve permissions (-p, --perms). The permissions of the destination file will be same as the source file. For what happens if this option is switched off, please read rsync's manual page.
sa: अनुमतिः संरक्षितुम् (-p, --perms)। गन्तव्यसञ्चिकायाः अनुमतिः स्रोतसञ्चिकायाः समानाः भविष्यन्ति । यदि एषः विकल्पः निष्क्रियः भवति तर्हि किं भवति इति कृते कृपया rsync इत्यस्य पुस्तिकापृष्ठं पठन्तु ।

source: Preserve access control lists (ACLs)
sa: अभिगमननियन्त्रणसूचीनां (ACLs) संरक्षणं कुर्वन्तु ।

source: Preserve access control lists. This option causes rsync to update the destination ACLs to be the same as the source ACLs. The option also implies --perms. The source and destination systems must have compatible ACL entries for this option to work properly.
sa: अभिगमननियन्त्रणसूचीनां संरक्षणं कुर्वन्तु। एषः विकल्पः rsync इत्यस्य गन्तव्य ACLs इत्यस्य अद्यतनीकरणं करोति यत् ते स्रोत ACLs इत्यस्य समानाः भवेयुः । विकल्पः --perms इत्यपि अभिप्रेतवान् । अस्य विकल्पस्य सम्यक् कार्यं कर्तुं स्रोत-गन्तव्य-प्रणालीषु संगत-ACL-प्रविष्टयः भवितुमर्हन्ति ।

source: Preserve extended attributes
sa: विस्तारितानि विशेषतानि रक्षन्तु

source: Preserve extended attributes. This option causes rsync to update the destination extended attributes to be the same as the source ones.
sa: विस्तारितानां विशेषतानां संरक्षणं कुर्वन्तु। एषः विकल्पः rsync इत्यस्य गन्तव्यविस्तारितविशेषणानि स्रोतविशेषणानां समानानि भवितुं अद्यतनं करोति ।

source: Preserve access times
sa: अभिगमनसमयान् संरक्षितुम्

source: Preserve access times. This tells rsync to set the access (use) times of the destination files to the same value as the source files.
sa: अभिगमनसमयान् रक्षन्तु। एतेन rsync इत्यस्मै गन्तव्यसञ्चिकानां अभिगमनसमयाः (उपयोगः) स्रोतसञ्चिकानां समानमूल्ये सेट् कर्तुं कथ्यते ।

source: Preserve create times
sa: संरक्षतु सृजति समयाः

source: Preserve create times. This tells rsync to set the create times (newness) of the destination files to the same value as the source files.
sa: संरक्षतु सृजति समयाः। एतेन rsync इत्यस्मै गन्तव्यसञ्चिकानां create times (newness) स्रोतसञ्चिकानां समानमूल्ये सेट् कर्तुं कथ्यते ।

source: Preserve group
sa: समूहं संरक्षितं कुर्वन्तु

source: Preserve the group (-g, --group). The group of the destination file will be set to the same value as the source file.
sa: समूहं (-g, --group) संरक्षितं कुर्वन्तु। गन्तव्यसञ्चिकायाः समूहः स्रोतसञ्चिकायाः समानमूल्ये सेट् भविष्यति ।

source: Preserve owner
sa: संरक्षण स्वामिना

source: Preserve the owner (-o, --owner). The owner of the destination file will be set to the same value as the source file, but only if the receiving rsync is run as the super user. Without this option, the owner is set to the invoking user on the receiving side.
sa: स्वामिनं (-ओ, --स्वामिनं) रक्षतु। गन्तव्यसञ्चिकायाः स्वामी स्रोतसञ्चिकायाः समानमूल्ये सेट् भविष्यति, परन्तु केवलं यदा ग्राहकः rsync सुपर उपयोक्तृरूपेण चालितः भवति । एतत् विकल्पं विना स्वामिना ग्राहकपक्षे आह्वानकर्तृप्रयोक्त्रे सेट् भवति ।

source: Preserve device and special files
sa: यन्त्रं विशेषसञ्चिकां च संरक्षन्तु

source: Preserve device and special files (-D, --devices --specials). This option causes rsync to transfer character and block devices as well as special files such as named sockets and fifos. It works only partially if rsync is not run as super user and the --super option is not specified.
sa: यन्त्रं विशेषसञ्चिकां च (-D, --devices --specials) संरक्षितव्यम् । एतेन विकल्पेन rsync इत्यनेन वर्ण-अवरोध-यन्त्राणि तथा च नामकृतानि sockets, fifos इत्यादीनि विशेषसञ्चिकाः च स्थानान्तरिताः भवन्ति । यदि rsync सुपर उपयोक्तृरूपेण न चाल्यते तथा च --super विकल्पः निर्दिष्टः न भवति तर्हि एतत् केवलं आंशिकरूपेण कार्यं करोति ।

source: Preserve times
sa: समयं संरक्षतु

source: Preserve times (-t, --times). The modification times are transferred along with the files. For what happens if this option is switched off, please read rsync's manual page.
sa: समयों (-त, --समय) संरक्षित करें। परिवर्तनसमयाः सञ्चिकाभिः सह स्थानान्तरिताः भवन्ति । यदि एषः विकल्पः निष्क्रियः भवति तर्हि किं भवति इति कृते कृपया rsync इत्यस्य पुस्तिकापृष्ठं पठन्तु ।

source: Omit directories when preserving times
sa: समयस्य संरक्षणे निर्देशिकाः परित्यजन्तु

source: Omit directories when preserving times (-O, --omit-dir-times). This means that directories are omitted when modification times are being preserved. Thus, this feature only works in conjunction with --times.
sa: समयस्य संरक्षणं कुर्वन् निर्देशिकाः परित्यजन्तु (-O, --omit-dir-times) । परिवर्तनसमयानां संरक्षणे निर्देशिकाः लोप्यन्ते इति अस्य अर्थः । एवं च एतत् विशेषता केवलं --times इत्यनेन सह कार्यं करोति ।

source: Remove synchronized source files
sa: समन्वयितस्रोतसञ्चिकाः निष्कासयन्तु

source: Remove all synchronized source files (--remove-source-files). This tells rsync to remove from the sending side the non-directory items that are a part of the transfer and have been successfully duplicated on the receiving side.
sa: सर्वाणि समन्वयितानि स्रोतसञ्चिकानि (--remove-source-files) निष्कासयन्तु । एतेन rsync इत्यस्मै प्रेषकपक्षतः तान् अनिर्देशिकावस्तूनाम् अपसारयितुं कथ्यते ये स्थानान्तरणस्य भागाः सन्ति तथा च ग्राहकपक्षे सफलतया डुप्लिकेट् कृताः सन्ति ।

source: Delete extraneous files
sa: अतिरिक्तसञ्चिकाः विलोपयन्तु

source: Delete extraneous files from destination (--delete). This tells rsync to delete all files from the receiving side that are not present on the sending side, but only for the directories that are being synchronized.
sa: गन्तव्यस्थानात् अतिरिक्तसञ्चिकाः विलोपयन्तु (--delete) । एतेन rsync इत्यस्मै ग्राहकपक्षतः सर्वाणि सञ्चिकानि विलोपयितुं कथ्यते ये प्रेषकपक्षे न सन्ति, परन्तु केवलं समन्वयितानां निर्देशिकानां कृते एव ।

source: Delete files before transfer
sa: स्थानान्तरणात् पूर्वं सञ्चिकाः विलोपयन्तु

source: Delete files on the receiving side before the transfer starts (--delete-before). This is the default behavior if --delete or --delete-excluded is specified without one of the --delete-WHEN options.
sa: स्थानान्तरणस्य आरम्भात् पूर्वं ग्राहकपक्षे सञ्चिकाः विलोपयन्तु (--delete-before) । यदि --delete अथवा --delete-excluded --delete-WHEN विकल्पेषु एकं विना निर्दिष्टं भवति तर्हि एषः पूर्वनिर्धारितः व्यवहारः अस्ति ।

source: Delete files after transfer
sa: स्थानान्तरणस्य अनन्तरं सञ्चिकाः विलोपयन्तु

source: Delete files on the receiving side after the transfer has completed (--delete-after, --del).
sa: स्थानान्तरणस्य समाप्तेः अनन्तरं ग्राहकपक्षे सञ्चिकाः विलोपयन्तु (--delete-after, --del) ।

source: Delete files during transfer
sa: स्थानान्तरणस्य समये सञ्चिकाः विलोपयन्तु

source: Delete files on the receiving side during the transfer (--delete-during). This method is faster than --delete-before or --delete-after, but it is only supported with rsync 2.6.4 or later.
sa: स्थानान्तरणस्य समये (--delete-during) ग्राहकपक्षे सञ्चिकाः विलोपयन्तु । एषा पद्धतिः --delete-before अथवा --delete-after इत्यस्मात् द्रुततरम् अस्ति, परन्तु केवलं rsync 2.6.4 अथवा ततः परं समर्थितम् अस्ति ।

source: Delete excluded files
sa: बहिष्कृतसञ्चिकाः विलोपयन्तु

source: Also delete excluded files from destination directory (--delete-excluded). In addition to deleting the files on the receiving side that are not on the sending side, this tells rsync to also delete any files on the receiving side that are excluded. Refer to rsync's manual page for further information.
sa: गन्तव्यनिर्देशिकातः बहिष्कृतसञ्चिकाः अपि विलोपयन्तु (--delete-excluded) । प्रेषकपक्षे न सन्ति इति ग्राहकपक्षे सञ्चिकाः विलोपयितुं अतिरिक्तं, एतत् rsync इत्यस्मै कथयति यत् ग्राहकपक्षे ये सञ्चिकाः बहिष्कृताः सन्ति ताः अपि विलोपयन्तु अधिकविवरणार्थं rsync इत्यस्य पुस्तिकापृष्ठं पश्यन्तु ।

source: Delete even if I/O errors occur
sa: I/O त्रुटयः भवन्ति चेदपि विलोपयन्तु

source: Delete even if I/O errors occur (--ignore-errors). This option has to be specified in conjunction with --delete to take effect.
sa: I/O त्रुटयः भवन्ति चेदपि विलोपयन्तु (--ignore-errors) । एषः विकल्पः प्रभावितुं --delete इत्यनेन सह निर्दिष्टः भवितुम् अर्हति ।

source: Force deletion of non-void directories
sa: अशून्यनिर्देशिकानां बलात् लोपः

source: Force deletion of directories even if they are not empty (--force). This option tells rsync to delete a non-empty directory when it is to be replaced by a non-directory. This is only relevant if deletions are not active.
sa: निर्देशिकानां रिक्तं न भवति चेदपि बलात् लोपः (--force) । एषः विकल्पः rsync इत्यस्मै अशून्यनिर्देशिकां विलोपयितुं वदति यदा तस्याः स्थाने अनिर्देशिकायाः स्थाने अन्यः निर्देशिका भवति । एतत् केवलं तदा एव प्रासंगिकं यदा लोपाः सक्रियः न सन्ति ।

source: Do not delete more than this many files:
sa: एतावता अधिकानि सञ्चिकाः न विलोपयन्तु:

source: Only delete as many files as defined here (--max-delete=NUM). This tells rsync not to delete more than NUM files or directories (NUM must be non-zero). This is useful when mirroring very large trees to prevent disasters.
sa: केवलं यावन्तः सञ्चिकाः अत्र परिभाषिताः (--max-delete=NUM) अपास्यन्तु । एतेन rsync इत्यस्मै NUM सञ्चिकाः अथवा निर्देशिकाः अधिकानि न विलोपयितुं वदन्ति (NUM शून्यरहितं भवितुमर्हति) । अत्यन्तं विशालानां वृक्षाणां प्रतिबिम्बं कृत्वा आपदानिवारणाय एतत् उपयोगी भवति ।

source: Value for DeleteMaximum config entry
sa: DeleteMaximum विन्यासप्रविष्टेः कृते मूल्यम्

source: Do not transfer any file smaller than:
sa: इत्यस्मात् लघुतरं किमपि सञ्चिकां न स्थानान्तरयन्तु:

source: This option causes rsync to not transfer any file that is smaller than the specified size (--min-size=SIZE).
sa: एषः विकल्पः rsync इत्यनेन निर्दिष्टाकारात् (--min-size=SIZE) लघुतरं किमपि सञ्चिकां न स्थानान्तरयति ।

source: Value for MinimalTransferSize config entry
sa: MinimalTransferSize विन्यासप्रविष्टेः कृते मूल्यम्

source: Do not transfer any file larger than:
sa: इत्यस्मात् बृहत्तरं किमपि सञ्चिकां न स्थानान्तरयन्तु:

source: This option causes rsync to not transfer any file that is larger than the specified size (--max-size=SIZE).
sa: एषः विकल्पः rsync इत्यनेन निर्दिष्टाकारात् (--max-size=SIZE) बृहत्तरं किमपि सञ्चिकां न स्थानान्तरयति ।

source: Value for MaximalTransferSize config entry
sa: MaximalTransferSize विन्यासप्रविष्टेः कृते मूल्यम्

source: Keep partially transferred files
sa: आंशिकरूपेण स्थानान्तरितसञ्चिकाः स्थापयन्तु

source: Keep partially transferred files (--partial). The default behavior is that any partially transferred file is deleted if the transfer is interrupted.
sa: आंशिकरूपेण स्थानान्तरितसञ्चिकाः (--आंशिकरूपेण) स्थापयन्तु । पूर्वनिर्धारितः व्यवहारः अस्ति यत् यदि स्थानान्तरणं बाधितं भवति तर्हि कोऽपि आंशिकरूपेण स्थानान्तरिता सञ्चिका विलोप्यते ।

source: Put partially transferred files into:
sa: आंशिकरूपेण स्थानान्तरितसञ्चिकाः अत्र स्थापयन्तु:

source: Put a partially transferred file into this directory (--partial-dir=DIR). This is a better way than the --partial option to keep partial files, because the partially transferred file is kept in a different directory and the destination file is not overwritten.
sa: आंशिकरूपेण स्थानान्तरितां सञ्चिकां अस्मिन् निर्देशिकायां (--partial-dir=DIR) स्थापयन्तु । आंशिकसञ्चिकाः स्थापयितुं --partial विकल्पात् एषः उत्तमः उपायः अस्ति, यतः आंशिकरूपेण स्थानान्तरिता सञ्चिका भिन्ननिर्देशिकायां स्थापिता भवति तथा च गन्तव्यसञ्चिका अधिलिखिता नास्ति

source: The data for the UsePartialDirectory option
sa: UsePartialDirectory विकल्पस्य कृते दत्तांशः

source: Auto-ignore files in the same way CVS does
sa: यथा CVS करोति तथा सञ्चिकाः स्वयमेव अवहेलयन्तु

source: Auto-ignore files in the same way CVS does (-C, --cvs-exclude). This is a useful shorthand for excluding a broad range of files that you often do not want to transfer between systems. This option uses the same algorithm that CVS uses to determine if a file should be ignored.
sa: CVS यथा करोति (-C, --cvs-exclude) तथैव सञ्चिकानां स्वतः अवहेलनां करोति । इदं सञ्चिकानां विस्तृतपरिधिं बहिष्कृत्य उपयोगी आशुलिपिः अस्ति यत् भवान् प्रायः प्रणालीनां मध्ये स्थानान्तरयितुम् न इच्छति । अयं विकल्पः तस्यैव अल्गोरिदम् इत्यस्य उपयोगं करोति यत् CVS इत्यनेन सञ्चिकायाः अवहेलना कर्तव्या वा इति निर्धारयितुं उपयुज्यते ।

source: Exclude files matching this pattern:
sa: अस्य प्रतिरूपस्य मेलनं कुर्वन्ति सञ्चिकाः बहिष्कृताः कुर्वन्तु:

source: Exclude files that match a certain pattern (--exclude=PATTERN). This is a special filter rule. For further information on filter rules see rsync's manual page.
sa: कस्यचित् प्रतिरूपस्य (--exclude=PATTERN) मेलनं कुर्वन्ति सञ्चिकाः बहिष्कृताः । एषः विशेषः छानकनियमः अस्ति । फ़िल्टरनियमानां विषये अधिकविवरणार्थं rsync इत्यस्य पुस्तिकापृष्ठं पश्यन्तु ।

source: Pattern that is used for file exclusion
sa: सञ्चिकाबहिष्कारार्थं यत् प्रतिरूपं उपयुज्यते

source: Read exclude patterns from:
sa: पठन्तु बहिष्कृतानि प्रतिमानाः तः:

source: Read exclude patterns from a file (--exclude-from=FILE). This option is similar to the --exclude=PATTERN option except that the exclude patterns are read from a file. This is a special filter rule. For further information on filter rules see rsync's manual page.
sa: सञ्चिकातः बहिष्कृतानि प्रतिमानाः पठन्तु (--exclude-from=FILE) । एषः विकल्पः --exclude=PATTERN विकल्पस्य सदृशः अस्ति व्यतिरिक्तं यत् exclude प्रतिमानाः सञ्चिकातः पठ्यन्ते । एषः विशेषः छानकनियमः अस्ति । फ़िल्टर नियमानाम् अधिकविवरणार्थं rsync इत्यस्य पुस्तिकापृष्ठं पश्यन्तु ।

source: The file from which the exclude patterns are read
sa: यस्मात् सञ्चिकातः exclude patterns पठ्यन्ते

source: Include files matching this pattern:
sa: अस्य प्रतिरूपस्य अनुरूपाः सञ्चिकाः समाविष्टाः कुर्वन्तु:

source: Do not exclude files matching a certain pattern (--include=PATTERN). This is a special filter rule. For further information on filter rules see rsync's manual page.
sa: कस्यचित् प्रतिरूपस्य (--include=PATTERN) मेलनं कुर्वन्तः सञ्चिकाः न बहिष्कृताः । एषः विशेषः छानकनियमः अस्ति । फ़िल्टरनियमानां विषये अधिकविवरणार्थं rsync इत्यस्य पुस्तिकापृष्ठं पश्यन्तु ।

source: Pattern that is used for file inclusion
sa: सञ्चिकासमावेशार्थं यत् प्रतिरूपं उपयुज्यते

source: Read include patterns from:
sa: पठन्तु include patterns from:

source: Read include patterns from a file (--include-from=FILE). This option is similar to the --include=PATTERN option except that the include patterns are read from a file. This is a special filter rule. For further information on filter rules see rsync's manual page.
sa: सञ्चिकातः (--include-from=FILE) प्रतिमानाः समाविष्टाः पठन्तु । एषः विकल्पः --include=PATTERN विकल्पस्य सदृशः अस्ति व्यतिरिक्तं यत् include प्रतिमानाः सञ्चिकातः पठ्यन्ते । एषः विशेषः छानकनियमः अस्ति । फ़िल्टर नियमानाम् अधिकविवरणार्थं rsync इत्यस्य पुस्तिकापृष्ठं पश्यन्तु ।

source: The file from which the include patterns are read
sa: यस्मात् सञ्चिकातः include patterns पठ्यन्ते

source: Custom filter rules:
sa: कस्टम् फ़िल्टर नियमाः :

source: Add custom file-filtering rules (-f, --filter=RULE). This option allows you to add rules to selectively exclude certain files from the list of files to be transferred. These rules will be added to the rsync command as they are. Thus, each rule has to start with the --filter=... argument.
sa: इष्टसञ्चिका-छनन-नियमाः (-f, --filter=RULE) योजयन्तु । एषः विकल्पः भवन्तं स्थानान्तरणीयानां सञ्चिकानां सूचीतः कतिपयान् सञ्चिकान् चयनात्मकरूपेण बहिष्कृत्य नियमान् योजयितुं शक्नोति । एते नियमाः rsync आदेशे यथा सन्ति तथा योजिताः भविष्यन्ति । एवं प्रत्येकं नियमं --filter=... तर्केन आरभणीयम् ।

source: Custom filter rules
sa: कस्टम् फ़िल्टर नियमाः

source: Use --filter='dir-merge /.rsync-filter' filter rule
sa: --filter='dir-merge /.rsync-filter' फ़िल्टर नियमस्य उपयोगं कुर्वन्तु

source: This filter rule tells rsync to look for per-directory .rsync-filter files that have been sprinkled through the hierarchy and use their rules to filter the files in the transfer. It has no effect, if you also choose to use the --filter='exclude .rsync-filter' rule.
sa: एषः फ़िल्टर नियमः rsync इत्यस्मै प्रति-निर्देशिका .rsync-filter सञ्चिकाः अन्वेष्टुं वदति ये पदानुक्रमेण सिञ्चिताः सन्ति तथा च स्थानान्तरणे सञ्चिकाः फ़िल्टर कर्तुं तेषां नियमानाम् उपयोगं कुर्वन्तु । तस्य कोऽपि प्रभावः नास्ति, यदि भवान् --filter='exclude .rsync-filter' इति नियमस्य उपयोगं कर्तुं अपि चिनोति ।

source: Use --filter='exclude .rsync-filter' filter rule
sa: --filter='exclude .rsync-filter' फ़िल्टर नियमस्य उपयोगं कुर्वन्तु

source: This rule filters out the .rsync-filter files from the transfer. These files normally contain filter rules that can be activated by choosing the --filter='dir-merge /.rsync-filter' rule and deselecting this one.
sa: एषः नियमः स्थानान्तरणात् .rsync-filter सञ्चिकाः छानयति । एतेषु सञ्चिकासु सामान्यतया फ़िल्टरनियमाः सन्ति ये --filter='dir-merge /.rsync-filter' नियमं चित्वा एतत् अचयनं कृत्वा सक्रियं कर्तुं शक्यन्ते ।

source: Handle sparse files efficiently
sa: विरलसञ्चिकाः कुशलतया सम्पादयन्तु

source: Handle sparse files efficiently (-S, --sparse) so that they take up less space on the destination. This option conflicts with --inplace. For further information read rsync's manual page.
sa: विरलसञ्चिकाः कुशलतया (-S, --sparse) सम्पादयन्तु येन ते गन्तव्यस्थाने न्यूनं स्थानं गृह्णन्ति । एषः विकल्पः --inplace इत्यनेन सह विग्रहं करोति । अधिकविवरणार्थं rsync इत्यस्य पुस्तिकापृष्ठं पठन्तु ।

source: Copy files whole (no rsync algorithm)
sa: सञ्चिकाः सम्पूर्णतया प्रतिलिपिं कुर्वन्तु ( no rsync algorithm)

source: Copy files whole (-W, --whole-file). With this option the incremental rsync algorithm is not used and the whole file is sent as-is instead.
sa: सञ्चिकाः सम्पूर्णानि (-W, --whole-file) प्रतिलिख्यताम् । एतेन विकल्पेन सह incremental rsync algorithm न उपयुज्यते तथा च तस्य स्थाने सम्पूर्णं सञ्चिका यथावत् प्रेष्यते ।

source: Do not cross file system boundaries
sa: सञ्चिकातन्त्रस्य सीमां न लङ्घयन्तु

source: Do not cross file system boundaries (-x, --one-file-system). This tells rsync to avoid crossing a filesystem boundary when recursing. For further information on this option, read the manual page.
sa: सञ्चिकातन्त्रस्य सीमां (-x, --one-file-system) न लङ्घयन्तु । एतेन rsync इत्यस्मै पुनरावृत्तिकाले सञ्चिकातन्त्रस्य सीमां पारं न कर्तुं कथ्यते । अस्य विकल्पस्य अधिकविवरणार्थं पुस्तिकापृष्ठं पठन्तु ।

source: Only update files that already exist
sa: केवलं तानि सञ्चिकानि अद्यतनं कुर्वन्तु ये पूर्वमेव विद्यन्ते

source: Skip creating new files on the receiving side (--existing). This tells rsync to skip creating files (including directories) that do not exist yet on the destination. If this option is combined with the --ignore-existing option, no files will be updated (which can be useful if all you want to do is to delete extraneous files).
sa: ग्राहकपक्षे (--विद्यमानम्) नूतनानां सञ्चिकानां निर्माणं त्यजन्तु । एतेन rsync इत्यस्मै गन्तव्यस्थाने अद्यापि न विद्यमानाः सञ्चिकाः (निर्देशिकाः च) निर्मातुं त्यक्तुं वदन्ति । यदि एषः विकल्पः --ignore-existing विकल्पेन सह संयोजितः अस्ति तर्हि कोऽपि सञ्चिका अद्यतनः न भविष्यति (यदि भवान् केवलं अतिरिक्तसञ्चिकाः विलोपयितुम् इच्छति तर्हि उपयोगी भवितुम् अर्हति) ।

source: Ignore files that already exist
sa: पूर्वमेव विद्यमानाः सञ्चिकाः अवहेलयन्तु

source: Skip updating files that already exist on the receiving side (--ignore-existing). Existing directories are not ignored.
sa: ग्राहकपक्षे पूर्वमेव विद्यमानाः सञ्चिकाः अद्यतनीकरणं त्यजन्तु (--ignore-existing) । विद्यमाननिर्देशिकाः उपेक्षिताः न भवन्ति ।

source: Delay updates until the end of transfer
sa: स्थानान्तरणस्य अन्त्यपर्यन्तं अद्यतनं विलम्बयन्तु

source: Delay updates until the end of the transfer (--delay-updates). This option puts the temporary file from each updated file into a holding directory until the end of the transfer, at which time all the files are renamed and copied into place in rapid succession.
sa: स्थानान्तरणस्य अन्त्यपर्यन्तं अद्यतनं विलम्बं कुर्वन्तु (--delay-updates)। एषः विकल्पः प्रत्येकस्मात् अद्यतनसञ्चिकातः अस्थायीसञ्चिकां स्थानान्तरणस्य अन्त्यपर्यन्तं धारणनिर्देशिकायां स्थापयति, तस्मिन् समये सर्वाणि सञ्चिकानि नाम परिवर्त्य द्रुतक्रमेण स्थाने प्रतिलिपिताः भवन्ति

source: Make backups
sa: बैकअपं कुर्वन्तु

source: Make backups (-b, --backup). With this option, preexisting destination files are renamed as each file is transferred or deleted. You can control where the backup file goes and what (if any) suffix gets appended using the --backup-dir=DIR and --suffix=SUFFIX options.
sa: बैकअप (-b, --backup) करणीयम् । एतेन विकल्पेन प्रत्येकं सञ्चिकायाः स्थानान्तरणं वा विलोपनं वा भवति चेत् पूर्वविद्यमानगन्तव्यसञ्चिकानां नामकरणं भवति । --backup-dir=DIR तथा --suffix=SUFFIX विकल्पानां उपयोगेन भवान् बैकअप सञ्चिका कुत्र गच्छति तथा च किं (यदि अस्ति) प्रत्ययः संलग्नः भवति इति नियन्त्रयितुं शक्नोति ।

source: Backup suffix:
sa: बैकअप प्रत्ययः :

source: Use this suffix for backups (--suffix=SUFFIX).
sa: बैकअप्स कृते एतत् प्रत्ययम् उपयुज्यताम् (--suffix=SUFFIX) ।

source: Backup suffix
sa: बैकअप प्रत्ययः

source: Backup directory:
sa: बैकअप निर्देशिका :

source: Store backups in this directory (--backup-dir=DIR).
sa: अस्मिन् निर्देशिकायां (--backup-dir=DIR) बैकअप्स संग्रहयन्तु ।

source: Backup directory
sa: बैकअप निर्देशिका

source: Force fixed checksum block size:
sa: बलेन नियत चेकसम ब्लॉक आकारः:

source: Force a fixed checksum block-size (-B, --block-size=SIZE). This forces the block size used in the rsync algorithm to a fixed value.
sa: एकं नियतं चेकसम ब्लॉक-आकारं (-B, --block-size=SIZE) बाध्यं कुर्वन्तु । एतेन rsync algorithm इत्यस्मिन् प्रयुक्तं block आकारं नियतमूल्यं प्रति बाध्यते ।

source: The block size
sa: खण्डस्य आकारः

source: Set block/file checksum seed:
sa: ब्लॉक/सञ्चिका चेकसम बीजं सेट् कुर्वन्तु:

source: Set block/file checksum seed (--checksum-seed=NUM). Set the MD4 checksum seed to this integer. This 4 byte checksum seed is included in each block and file MD4 checksum calculation. By default the checksum seed is generated by the server and defaults to the current time.
sa: ब्लॉक/सञ्चिका चेकसम बीज (--checksum-seed=NUM) सेट् कुर्वन्तु । MD4 चेकसम बीजं अस्मिन् पूर्णाङ्के सेट् कुर्वन्तु । इदं 4 बाइट् चेकसम बीजं प्रत्येकस्मिन् खण्डे सञ्चिकायां च MD4 चेकसम गणने समाविष्टम् अस्ति । पूर्वनिर्धारितरूपेण चेकसम बीजं सर्वरेण उत्पद्यते, वर्तमानसमये पूर्वनिर्धारितं च भवति ।

source: The value for the UseChecksumSeed config option
sa: UseChecksumSeed विन्यासविकल्पस्य मूल्यम्

source: Skip files based on checksum
sa: चेकसम इत्यस्य आधारेण सञ्चिकाः त्यजन्तु

source: Skip files based on a checksum and not based on modification time and size (-c, --checksum). For further information on how this feature works read rsync's manual page.
sa: चेकसम इत्यस्य आधारेण सञ्चिकाः त्यजन्तु न तु परिवर्तनसमयस्य आकारस्य च आधारेण (-c, --checksum) । एतत् विशेषता कथं कार्यं करोति इति अधिकविवरणार्थं rsync इत्यस्य पुस्तिकापृष्ठं पठन्तु ।

source: Set bandwidth limit:
sa: बैण्डविड्थसीमा निर्धारयन्तु :

source: Set the maximum data transfer rate in kilobytes per second (--bwlimit=RATE).
sa: अधिकतमं आँकडा स्थानान्तरणदरं प्रति सेकण्ड् किलोबाइट् मध्ये सेट् कुर्वन्तु (--bwlimit=RATE) ।

source: The value for the UseBandwidthLimit config option
sa: UseBandwidthLimit विन्यासविकल्पस्य मूल्यम्

source: Use profiles
sa: प्रोफाइलस्य उपयोगं कुर्वन्तु

source: Make Smb4K use profiles. This enables you to define different bookmarks and custom options for each profile. This is especially useful if you are using a laptop in different network neighborhoods, e. g. at home and at work.
sa: Smb4K इत्यस्य प्रोफाइलस्य उपयोगं कुर्वन्तु। एतेन प्रत्येकस्य प्रोफाइलस्य कृते भिन्नानि पुस्तकचिह्नानि, इष्टविकल्पानि च परिभाषितुं शक्यन्ते । यदि भवान् भिन्न-भिन्न-जाल-परिसरयोः लैपटॉपस्य उपयोगं करोति तर्हि एतत् विशेषतया उपयोगी भवति, ङ. छ. गृहे कार्ये च।

source: Profiles
sa: प्रोफाइल

source: The list of profiles.
sa: प्रोफाइलस्य सूची ।

source: Active profile
sa: सक्रिय प्रोफाइल

source: This is the currently active profile.
sa: एतत् सम्प्रति सक्रियरूपरेखा अस्ति ।

source: %1 on %2
sa: %2 इत्यत्र %1

source: The format of %1 is not supported.
sa: %1 इत्यस्य प्रारूपं समर्थितं नास्ति ।

source: The file %1 could not be read
sa: %1 इति सञ्चिका पठितुं न शक्यते स्म

source: The file %1 could not be printed to %2
sa: %1 सञ्चिका %2 मध्ये मुद्रितुं न शक्यते स्म
