Repository: KDE/smb4k
Catalog: po/sa/smb4k.po
Languages: sa

# NAME OF TRANSLATORS
source: Your names
sa: श्रीकान्त् कलवार्

# EMAIL OF TRANSLATORS
source: Your emails
sa: skkalwar999@gmail.com

source: The mount process could not be started.
sa: माउण्ट् प्रक्रिया आरभ्यतुं न शक्यते स्म ।

source: The unmount process could not be started.
sa: अनमाउण्ट् प्रक्रिया आरभ्यतुं न शक्यते स्म ।

source: Advanced network neighborhood browser and Samba share mounting utility
sa: उन्नतजालपरिसरस्य ब्राउजर् तथा साम्बा माउण्टिङ्ग् उपयोगिता साझां कुर्वन्ति

source: Alexander Reinholdt
sa: अलेक्जेण्डर रेनहोल्ड्ट्

source: Developer
sa: विकासकः

source: Donator
sa: दाता

source: &File
sa: &संचिका

source: &Network
sa: &जाल

source: Sh&ares
sa: श&अरेस्

source: &Bookmarks
sa: &पुस्तकचिह्न

source: &Settings
sa: &सेटिंग्स

source: Main Toolbar
sa: मुख्य साधनपट्टी

source: Bookmark Shares
sa: बुकमार्क शेयर्स्

source: All listed shares will be bookmarked. To add a label or category, double-click the respective bookmark entry.
sa: सूचीकृतानां सर्वेषां भागानां बुकमार्कं भविष्यति। लेबलं वा श्रेणीं वा योजयितुं तत्तत् पुस्तकचिह्नप्रविष्टिं द्विवारं क्लिक् कुर्वन्तु ।

source: Label:
sa: नामपत्र:

source: Category:
sa: कोटी:

source: Bookmark Editor
sa: बुकमार्क सम्पादक

source: Bookmarks
sa: बुकमार्क्स

source: Add &Bookmark
sa: &बुकमार्कं योजयतु

source: Mount Bookmarks
sa: माउण्ट् बुकमार्क

source: User Interface
sa: उपयोक्तृ-अन्तरफलकम्

source: Network
sa: जालकृति

source: Mounting
sa: माउण्टिङ्ग्

source: Synchronization
sa: समन्वयनम्

source: Authentication
sa: प्रमाणीकरणम्

source: (Profile: %1)
sa: (प्रोफाइलः %1)

source: Custom Settings
sa: कस्टम सेटिंग्स्

source: Profiles
sa: प्रोफाइल

source: An incorrect setting has been found. You are now taken to the corresponding configuration page to fix it.
sa: अशुद्धं सेटिंग् प्राप्तम् अस्ति । त्वं इदानीं गृहीतः तत् समाधातुं तत्सम्बद्धं विन्यासपृष्ठं प्रति ।

source: You have made changes to the profiles. You have to apply them in order to be able to use them in the rest of the configuration dialog.
sa: भवता प्रोफाइल् मध्ये परिवर्तनं कृतम् अस्ति । भवता आवेदनं कर्तव्यम् अस्ति तान् शेषेषु उपयोक्तुं शक्नुवन् इति क्रमेण विन्याससंवादः ।

source: Default Login
sa: पूर्वनिर्धारित प्रवेशः

source: Username:
sa: उपयोक्तृनाम :

source: Password:
sa: समाभाष्:

source: Workgroup:
sa: कार्यसमूहः :

source: IP Address:
sa: IP पता: 1.1.

source: Edit
sa: सम्पादन

source: Add Category
sa: श्रेणी योजयतु

source: Remove
sa: अपाकरोति

source: Clear List
sa: स्पष्ट सूची

source: New Category
sa: नवीन श्रेणी

source: All fine.
sa: सर्वं सुष्ठु।

source: The item <b>%1</b> was removed, because all custom settings were reset.
sa: <b>%1</b> इति द्रव्यं निष्कासितम्, यतः सर्वाणि इष्टसेटिंग्स् पुनः सेट् कृताः ।

source: Behavior
sa: व्यवहार

source: min
sa: मि

source: Basic Settings
sa: मूलभूत सेटिंग्स्

source: Common Options
sa: सामान्यविकल्पाः

source: CIFS Unix Extensions Support
sa: CIFS Unix Extensions समर्थनम्

source: Common Mount Settings
sa: सामान्यं माउण्ट् सेटिंग्स्

source: Advanced Options
sa: उन्नतविकल्पाः

source: Advanced Mount Settings
sa: उन्नत माउण्ट् सेटिंग्स्

source: Character Sets
sa: वर्णसमूहाः

source: Mount Settings
sa: सेटिंग्स् माउण्ट् कुर्वन्तु

source: Browse Settings
sa: सेटिंग्स् ब्राउज् कुर्वन्तु

source: Samba
sa: साम्बः

source: Wake-On-LAN
sa: जाग-ऑन-लैन्

source: s
sa: स

source: Define the hosts that should be woken up via the custom settings editor.
sa: कस्टम् सेटिङ्ग्स् सम्पादकस्य माध्यमेन ये होस्ट् जागृतव्याः तेषां परिभाषयन्तु ।

source: Advanced Settings
sa: उन्नत सेटिंग्स्

source: Settings
sa: सेटिंग्स्

source: Add
sa: संयोजयति

source: Set Active
sa: सक्रियं सेट् कुर्वन्तु

source: Move Up
sa: उपरि गच्छतु

source: Move Down
sa: अधः गच्छतु

source: Rename
sa: पुनर्नाम

source: Synchronization Directory
sa: समन्वयन निर्देशिका

source: Backups
sa: बैकअप्स

source: General
sa: सामान्य

source: Links
sa: लिङ्कानि

source: File Handling
sa: सञ्चिकानियन्त्रणम्

source: File Attributes
sa: सञ्चिका विशेषताएँ

source: Ownership
sa: स्वामित्वम्

source: File Attributes && Ownership
sa: सञ्चिका विशेषताएँ && स्वामित्व

source: Compression
sa: संपीडनम्

source: Files
sa: सञ्चिकाः

source: Miscellaneous
sa: विविध

source: kB/s
sa: केबी/से

source: File Transfer
sa: सञ्चिका स्थानान्तरणम्

source: Files && Directories
sa: सञ्चिकाः && निर्देशिकाः

source: Restrictions
sa: प्रतिबन्धाः

source: File Deletion
sa: सञ्चिकाविलोपनम्

source: General Filtering Settings
sa: सामान्यं छाननसेटिंग्स्

source: Filter Rules
sa: फ़िल्टर नियम

source: Filtering
sa: छाननम्

source: Checksums
sa: चेकसम

source: Main Window
sa: मुख्य खिडकी

source: Network Neighborhood
sa: नेटवर्क नेबरहुड

source: Shares View
sa: दृश्यं साझां करोति

source: Custom Settings Editor
sa: कस्टम सेटिंग्स् सम्पादक

source: No network item was set.
sa: कोऽपि जालवस्तु सेट् नासीत् ।

source: Define custom settings for host <b>%1</b> and all the shares it provides.
sa: होस्ट् <b>%1</b> कृते इष्टसेटिंग्स् परिभाषयन्तु तथा च तया प्रदत्तानां सर्वेषां भागानां कृते ।

source: Define custom settings for share <b>%1</b>.
sa: share <b>%1</b> कृते इष्टसेटिंग्स् परिभाषयन्तु ।

source: Always remount this share
sa: सदैव एतत् भागं पुनः माउण्ट् कुर्वन्तु

source: This server supports the CIFS Unix extensions
sa: अयं सर्वरः CIFS Unix विस्तारान् समर्थयति

source: MAC Address:
sa: MAC पता: 1.1.

source: Send magic packet before scanning the network neighborhood
sa: संजालपरिसरस्य स्कैनिङ्गं कर्तुं पूर्वं जादूपैकेट् प्रेषयन्तु

source: Send magic packet before mounting a share
sa: भागं माउण्ट् कर्तुं पूर्वं magic packet प्रेषयन्तु

source: Wake-On-LAN Settings
sa: Wake-On-LAN सेटिंग्स्

source: Specify User
sa: उपयोक्तारं निर्दिशन्तु

source: Please specify a username.
sa: कृपया उपयोक्तृनाम निर्दिशन्तु ।

source: Please specify a username for share<br><b>%1</b>.
sa: कृपया भागस्य कृते उपयोक्तृनाम निर्दिशन्तु<br> <b>%1</b> .

source: Dock Widgets
sa: डॉक विजेट्

source: Mounted Shares
sa: घुड़सवार शेयर

source: <qt>Closing the main window will keep Smb4K running in the system tray.<br>Use <i>Quit</i> from the <i>File</i> menu to quit the application.</qt>
sa: <qt>मुख्यविण्डो बन्दं कृत्वा Smb4K सिस्टम् ट्रे मध्ये चालितं भविष्यति ।<br> अनुप्रयोगात् निर्गन्तुं <i>File</i> मेन्यू तः <i>Quit इत्यस्य</i> उपयोगं कुर्वन्तु ।</qt>

source: Docking
sa: गोदी

source: There are currently no shares mounted.
sa: सम्प्रति कोऽपि भागः माउण्ट् न भवति ।

source: There is currently %1 share mounted.
sa: सम्प्रति %1 भागः माउण्ट् अस्ति ।

source: Looking for workgroups and domains...
sa: कार्यसमूहान् डोमेनान् च अन्विष्य...

source: Looking for hosts in domain %1...
sa: %1 डोमेन् मध्ये होस्ट् अन्विष्यते...

source: Looking for shares provided by host %1...
sa: होस्ट् %1 द्वारा प्रदत्तं भागं अन्विष्यते...

source: Looking for files and directories in %1...
sa: %1... इत्यस्मिन् सञ्चिकाः निर्देशिकाः च अन्विष्यन्ते...

source: Waking up remote hosts...
sa: दूरस्थं मेजबानं जागृत्य...

source: Sending file to printer %1...
sa: मुद्रकं प्रति सञ्चिकां प्रेषयति %1...

source: Searching...
sa: अन्वेषणं कुर्वन्...

source: Done.
sa: कृतम्‌।

source: Mounting...
sa: माउण्टिंग...

source: Unmounting...
sa: अनमाउंटिंग...

source: Waking up host...
sa: जागृत्य मेजबान...

source: %1 has been mounted successfully.
sa: %1 सफलतया माउण्ट् कृतम् अस्ति ।

source: %1 has been unmounted successfully.
sa: %1 सफलतया अनमाउण्ट् कृतम् अस्ति ।

source: Synchronizing %1
sa: %1 समन्वयनम्

source: Mount Dialog
sa: माउण्ट् संवाद

source: Enter the location and optionally the IP address and workgroup to mount a share.
sa: भागं माउण्ट् कर्तुं स्थानं वैकल्पिकरूपेण च IP-सङ्केतं कार्यसमूहं च प्रविशन्तु ।

source: Location:
sa: स्थानीय:

source: Bookmark this share
sa: एतत् भागं बुकमार्कं कुर्वन्तु

# Bookmark a share in the mount dialog.
source: Bookmark >>
sa: बुकमार्क >>

source: Type
sa: प्रकारः

source: IP Address
sa: IP Address इति

source: Comment
sa: टिप्पणी

source: Scan Netwo&rk
sa: स्कैन जाल&rk

source: &Abort
sa: &गर्भपात

source: &Search
sa: &अन्वेषण

source: Add &Custom Settings
sa: &कस्टम सेटिंग्स् योजयतु

source: &Open Mount Dialog
sa: &Open Mount संवाद

source: Au&thentication
sa: प्रमाणीकरणम्

source: Pre&view
sa: पूर्व&दृश्यम्

source: &Print File
sa: &सञ्चिकां मुद्रयतु

source: &Mount
sa: &माउंट

source: &Unmount
sa: &अनमाउंट

source: Scan Compute&r
sa: स्कैन कम्प्यूट&r

source: Scan Wo&rkgroup
sa: स्कैन कार्य&rkसमूह

source: Close
sa: पिधानं करोतु

source: Search string
sa: अन्वेषण स्ट्रिंग्

source: Search
sa: अन्वेषण

source: Stop
sa: विरमतु

source: Item Down
sa: मदः Down

source: Item Up
sa: मद Up

source: Clear
sa: स्पष्टः

source: Please enter a username and a password for the host <b>%1</b>.
sa: कृपया <b>%1</b> होस्ट् कृते उपयोक्तृनाम गुप्तशब्दं च प्रविशन्तु ।

source: Please enter a username and a password for the share <b>%1</b>.
sa: कृपया <b>%1</b> भागस्य उपयोक्तृनाम गुप्तशब्दं च प्रविशन्तु ।

source: Preview Dialog
sa: पूर्वावलोकनसंवादः

source: Reload
sa: पुनः लोड करें

source: Abort
sa: गर्भपातं कुरुत

source: Up
sa: उपरि

source: Preview of %1
sa: %1 इत्यस्य पूर्वावलोकनम्

source: Print Dialog
sa: मुद्रणसंवादः

source: Print a file.
sa: सञ्चिकां मुद्रयन्तु।

source: File:
sa: संचिका:

source: Copies:
sa: प्रतिलिपानि :

source: Print
sa: मुद्रण

source: Print a file to printer <b>%1</b>.
sa: <b>%1</b> मुद्रके सञ्चिकां मुद्रयन्तु ।

source: U&nmount All
sa: U&nmount सर्वम्

source: Unmount
sa: अनमाउंट

source: Add Bookmark
sa: बुकमार्कं योजयतु

source: Synchronize
sa: समन्वयनम्

source: Open with Konsole
sa: Konsole इत्यनेन उद्घाटयन्तु

source: Open with File Manager
sa: सञ्चिकाप्रबन्धकेन सह उद्घाटयन्तु

source: View Modes
sa: दृश्यविधानानि

source: Icon View
sa: चिह्नदृश्यम्

source: List View
sa: सूचीदृश्यम्

source: S&ynchronize
sa: S&ynchronize इति

source: Open with Konso&le
sa: Conso&le इत्यनेन सह उद्घाटयन्तु

source: Open with F&ile Manager
sa: F&ile Manager इत्यनेन सह उद्घाटयन्तु

source: <qt>There is no active connection to the share <b>%1</b>! You cannot drop any files here.</qt>
sa: <qt><b>%1</b> भागस्य सक्रियसंयोजनं नास्ति ! अत्र भवान् किमपि सञ्चिकां पातुं न शक्नोति ।</qt>

source: Source:
sa: स्रोतः:

source: Destination:
sa: गन्तव्य:

source: Swap Paths
sa: स्वैप पथ

source: Please provide the source and destination directory for the synchronization of <b>%1</b>.
sa: कृपया <b>%1</b> इत्यस्य समन्वयनार्थं स्रोतः गन्तव्यनिर्देशिकां च प्रदातव्यम् ।

source: Type:
sa: प्रकारः:

source: DNS-SD Browsing Domain
sa: DNS-SD ब्राउजिंग डोमेन

source: Workgroup
sa: कार्यसमूह

source: Master Browser:
sa: मास्टर ब्राउजर् :

source: Host
sa: निमन्त्रकः

source: Comment:
sa: टिप्पणी:

source: Share (%1)
sa: भाग (%1)

source: Mounted:
sa: माउण्टेड् :

source: yes
sa: आम्‌

source: no
sa: नहि

source: Host:
sa: निमन्त्रकः:

source: Mountpoint:
sa: पर्वतबिन्दुः :

source: unknown
sa: अज्ञात

source: Owner:
sa: स्वामी:

source: File system:
sa: सञ्चिकातन्त्रम् :

source: %1 free of %2 (%3 used)
sa: %1 %2 मुक्तं (%3 प्रयुक्तम्)

source: Size:
sa: आकृति:
