Repository: KDE/smb4k
Catalog: po/sa/smb4k-core.po
Languages: sa

source: The Zeroconf daemon is not running. No servers are discovered using DNS-SD.
sa: Zeroconf डेमन् न चाल्यते । DNS-SD इत्यस्य उपयोगेन कोऽपि सर्वरः आविष्कृतः नास्ति ।

source: Zeroconf support is not available in this version of KDE.
sa: KDE इत्यस्य अस्मिन् संस्करणे Zeroconf समर्थनं उपलब्धं नास्ति ।

source: An unknown error with Zeroconf occurred.
sa: Zeroconf इत्यनेन सह अज्ञातदोषः अभवत् ।

source: File mode:
sa: सञ्चिकाविधिः :

source: This is the file mode that will be used for creating files. It must be defined in octal.
sa: एषः एव सञ्चिकाविधिः यः सञ्चिकानिर्माणार्थं उपयुज्यते । अष्टकेन अवश्यमेव परिभाषितव्यम्।

source: Directory mode:
sa: निर्देशिकाविधिः :

source: This is the directory mode that will be used for creating directories. It must be defined in octal.
sa: एषः निर्देशिकाविधिः यः निर्देशिकानिर्माणार्थं उपयुज्यते । अष्टकेन अवश्यमेव परिभाषितव्यम्।

source: Use character sets
sa: वर्णसमूहानां उपयोगं कुर्वन्तु

source: This is the character set that is used by the client side (i.e. your side) for codepage to charset translations. If you keep the default setting, Smb4K will try to automatically determine the charset by looking up the "unix charset" option in the smb.conf.
sa: एषः वर्णसमूहः अस्ति यः क्लायन्ट् पक्षेन (अर्थात् भवतः पक्षेण) कोडपृष्ठतः charset अनुवादानाम् कृते उपयुज्यते । यदि भवान् पूर्वनिर्धारितं सेटिङ्ग् रक्षति तर्हि Smb4K smb.conf मध्ये "unix charset" विकल्पं दृष्ट्वा स्वयमेव charset निर्धारयितुं प्रयतते ।

source: Client character set:
sa: क्लायन्ट् वर्णसमूहः :

source: default
sa: मूलभूतम्‌

source: iso8859-8
sa: iso8859-8 इति

source: iso8859-13
sa: iso8859-13 इति

source: iso8859-14
sa: iso8859-14 इति

source: iso8859-15
sa: iso8859-15 इति

source: koi8-r
sa: कोइ८-र

source: koi8-u
sa: कोइ८-उ

source: koi8-ru
sa: कोइ८-रु

source: big5
sa: बृहत्५

source: tis-620
sa: तिस्-६२०

source: Server character set:
sa: सर्वर वर्णसमूहः :

source: This is the character set that is used by the server. If you keep the default setting, Smb4K will try to automatically determine the codepage by looking up the "dos charset" option in the smb.conf file.
sa: एषः वर्णसमूहः यः सर्वरेण उपयुज्यते । यदि भवान् पूर्वनिर्धारितं सेटिङ्ग् रक्षति तर्हि Smb4K smb.conf सञ्चिकायां "dos charset" विकल्पं दृष्ट्वा स्वयमेव कोडपृष्ठं निर्धारयितुं प्रयतते ।

source: unicode
sa: यूनिकोड इति

source: Unmount all personal shares on exit
sa: निर्गमनसमये सर्वाणि व्यक्तिगतभागाः अनमाउण्ट् कुर्वन्तु

source: Unmount all shares that belong to you when the program exits. Shares that are owned by other users are ignored.
sa: कार्यक्रमस्य निर्गमनसमये भवतः सर्वान् भागान् अनमाउण्ट् कुर्वन्तु । अन्येषां उपयोक्तृणां स्वामित्वं येषां भागानां भवति ते उपेक्षिताः भवन्ति ।

source: Remount shares
sa: शेयर्स् पुनः माउंट करें

source: Remount all your shares that were mounted when you exited the program or changed a profile. If the remounting of a share fails, Smb4K will retry the next time it is started. Shares that were mounted by other users are ignored. Please note that this setting does not affect the automatic remounting of shares when your computer woke up from a sleep state.
sa: भवता कार्यक्रमात् निर्गतस्य अथवा प्रोफाइल परिवर्तनस्य समये माउण्ट् कृतानि सर्वाणि भागानि पुनः माउण्ट् कृतवन्तः । यदि कस्यचित् भागस्य पुनः माउण्टिङ्ग् विफलं भवति तर्हि Smb4K अग्रिमे समये पुनः प्रयासं करिष्यति । अन्यैः उपयोक्तृभिः ये भागाः माउण्ट् कृताः आसन् ते उपेक्षिताः भवन्ति । कृपया ज्ञातव्यं यत् एतत् सेटिङ्ग् भवतः सङ्गणकस्य निद्रास्थित्याः जागरणसमये साझानां स्वचालितपुनर्स्थापनं न प्रभावितं करोति ।

source: Number of remount attempts:
sa: पुनः माउण्ट् प्रयत्नानाम् संख्या :

source: Set the number of attempts that are made to remount shares before Smb4K gives up.
sa: Smb4K इत्यस्य त्यागात् पूर्वं शेयर्स् पुनः माउण्ट् कर्तुं ये प्रयत्नाः क्रियन्ते तेषां संख्यां सेट् कुर्वन्तु ।

source: Interval between remount attempts:
sa: पुनः माउण्ट्-प्रयासानां मध्ये अन्तरालः :

source: Set the time that elapses between attempts to remount shares.
sa: शेयर्स् पुनः माउण्ट् कर्तुं प्रयत्नानाम् मध्ये यः समयः व्यतीतः सः सेट् कुर्वन्तु ।

source: Force the unmounting of inaccessible shares
sa: दुर्गमभागानाम् अनमाउण्टिङ्गं बाध्यं कुर्वन्तु

source: Force the unmounting of inaccessible shares (Linux only). In case a share is inaccessible, a lazy unmount is performed. Before the actual unmount is performed, a warning dialog is shown asking to approve the unmount.
sa: दुर्गमभागानाम् (केवलं लिनक्स) अनमाउण्टिङ्ग् कर्तुं बाध्यताम् । यदि भागः दुर्गमः भवति तर्हि आलस्यपूर्णः अनमाउण्ट् क्रियते । वास्तविकं अनमाउण्ट्-करणात् पूर्वं, अनमाउण्ट्-अनुमोदनं कर्तुं पृच्छन् चेतावनी-संवादः दर्शितः भवति ।

source: Detect all shares that are mounted on the system
sa: प्रणाल्यां माउण्ट् कृताः सर्वे भागाः अन्वेष्टुम्

source: You will not only see the shares that were mounted and are owned by you, but also all other mounts using the SMBFS and CIFS file system that are present on the system.
sa: भवान् न केवलं तानि भागानि द्रक्ष्यति ये माउण्ट् कृताः आसन्, भवतः स्वामित्वे च सन्ति, अपितु अन्ये सर्वे माउण्ट् अपि SMBFS तथा CIFS सञ्चिकातन्त्रस्य उपयोगेन ये प्रणाल्यां वर्तन्ते

source: All or most of the servers support the CIFS Unix extensions
sa: सर्वे वा अधिकांशः सर्वरः CIFS Unix विस्तारं समर्थयति

source: Most versions of Samba support the CIFS Unix or POSIX extensions. For these servers, some options are not needed, because the right values are negotiated during the mount process. For other servers, you might want to uncheck this option, so that predefined values can be passed to the server. Please note that if your computer is located in a Windows dominated network neighborhood with only a few Samba servers, you can safely uncheck this option and define custom options for the Samba servers.
sa: Samba इत्यस्य अधिकांशसंस्करणं CIFS Unix अथवा POSIX विस्तारस्य समर्थनं करोति । एतेषां सर्वराणां कृते केषाञ्चन विकल्पानां आवश्यकता नास्ति, यतः माउण्ट् प्रक्रियायाः समये समीचीनमूल्यानि वार्तालापिताः भवन्ति । अन्येषां सर्वराणां कृते भवान् एतत् विकल्पं अनचेक् कर्तुम् इच्छति, येन पूर्वनिर्धारितमूल्यानि सर्वरं प्रति प्रसारयितुं शक्यन्ते । कृपया ज्ञातव्यं यत् यदि भवतः सङ्गणकः केवलं कतिपयैः साम्बा-सर्वर्-सहितं विण्डोज-प्रधान-जाल-परिसरस्य मध्ये स्थितः अस्ति, तर्हि भवान् सुरक्षिततया एतत् विकल्पं अनचेक् कृत्वा साम्बा-सर्वर्-कृते कस्टम्-विकल्पान् परिभाषितुं शक्नोति

source: This is the file mode that will be used for creating files. It must be defined in octal. In case the CIFS file system is used, this setting only takes effect if the server does not support the CIFS Unix Extensions.
sa: एषः एव सञ्चिकाविधिः यः सञ्चिकानिर्माणार्थं उपयुज्यते । अष्टकेन अवश्यमेव परिभाषितव्यम्। CIFS सञ्चिकातन्त्रस्य उपयोगः भवति चेत्, एषा सेटिङ्ग् केवलं तदा प्रभावी भवति यदा सर्वरः CIFS Unix Extensions समर्थयति न ।

source: This is the filemode that will be used for creating files. It must be defined in octal. In case the CIFS file system is used, this setting only takes effect if the server does not support the CIFS Unix Extensions.
sa: एषः एव filemode यः सञ्चिकानिर्माणार्थं उपयुज्यते । अष्टकेन अवश्यमेव परिभाषितव्यम्। CIFS सञ्चिकातन्त्रस्य उपयोगः भवति चेत्, एषा सेटिङ्ग् केवलं तदा प्रभावी भवति यदा सर्वरः CIFS Unix Extensions समर्थयति न ।

source: This is the directory mode that will be used for creating directories. It must be defined in octal. In case the CIFS file system is used, this setting only takes effect if the server does not support the CIFS Unix Extensions.
sa: एषः निर्देशिकाविधिः यः निर्देशिकानिर्माणार्थं उपयुज्यते । अष्टकेन अवश्यमेव परिभाषितव्यम्। CIFS सञ्चिकातन्त्रस्य उपयोगः भवति चेत्, एषा सेटिङ्ग् केवलं तदा प्रभावी भवति यदा सर्वरः CIFS Unix Extensions समर्थयति न ।

source: This is the character set that is used by the client side (i.e. your side) either to convert local path names to and from Unicode (CIFS, Linux) or for codepage to charset translations (SMBFS, FreeBSD). If you keep the default setting, Smb4K will try to automatically determine the charset by looking up the "unix charset" option in the smb.conf.
sa: एषः वर्णसमूहः अस्ति यस्य उपयोगः क्लायन्ट् पक्षेन (अर्थात् भवतः पक्षेण) स्थानीयमार्गनामानि यूनिकोड-नगरं प्रति परिवर्तयितुं (CIFS, Linux) अथवा कोडपृष्ठं चरसेट् अनुवादेषु (SMBFS, FreeBSD) कृते वा उपयुज्यते यदि भवान् पूर्वनिर्धारितं सेटिङ्ग् रक्षति तर्हि Smb4K smb.conf मध्ये "unix charset" विकल्पं दृष्ट्वा स्वयमेव charset निर्धारयितुं प्रयतते ।

source: Write access:
sa: लेखनप्रवेशः :

source: Here you can choose if the shares should be mounted in read-write or read-only mode.
sa: अत्र भवान् चिन्वतु यत् भागाः पठन-लेखन-विधाने माउण्ट् कर्तव्याः वा केवलं पठन-विधाने वा ।

source: read-write
sa: पठित-लिख

source: read-only
sa: पठनीय एव

source: Definitely assign the UID
sa: निश्चितरूपेण UID नियुक्तं कुर्वन्तु

source: Instruct the client (i.e. your side) to ignore any user ID (UID) provided by the server for files and directories and to always assign the owner to be the value of the transmitted UID.
sa: क्लायन्ट् (अर्थात् भवतः पक्षः) सञ्चिकानां निर्देशिकानां च कृते सर्वरेण प्रदत्तं किमपि उपयोक्तृ-ID (UID) अवहेलितुं तथा च स्वामिनं सर्वदा प्रसारितस्य UID इत्यस्य मूल्यं नियुक्तुं निर्देशयन्तु

source: Definitely assign the GID
sa: निश्चितरूपेण GID नियुक्तं कुर्वन्तु

source: Instruct the client (i.e. your side) to ignore any group ID (GID) provided by the server for files and directories and to always assign the owner to be the value of the transmitted GID.
sa: क्लायन्ट् (अर्थात् भवतः पक्षः) सञ्चिकानां निर्देशिकानां च कृते सर्वरेण प्रदत्तं किमपि समूह-ID (GID) अवहेलितुं तथा च स्वामिनं सर्वदा प्रसारितस्य GID इत्यस्य मूल्यं नियुक्तुं निर्देशयन्तु

source: Do permission checks
sa: अनुमतिपरीक्षां कुर्वन्तु

source: The client side (i.e. your side) will check if you have the right UID/GID to manipulate a file or directory. You might want to switch this feature off if the server(s) support the CIFS Unix Extensions and you are not allowed to access the files and directories. This setting does not affect the normal ACL check.
sa: क्लायन्ट् पक्षः (अर्थात् भवतः पक्षः) परीक्षयिष्यति यत् भवतां समीपे सञ्चिकां वा निर्देशिकां वा परिवर्तयितुं समीचीनः UID/GID अस्ति वा । यदि सर्वर(s) CIFS Unix Extensions समर्थयति तथा च भवान् सञ्चिकाः निर्देशिकाश्च अभिगन्तुं न अनुमतः तर्हि भवान् एतत् विशेषतां निष्क्रियं कर्तुम् इच्छति । एषा सेटिङ्ग् सामान्य ACL परीक्षणं न प्रभावितं करोति ।

source: Attempt to set UID and GID
sa: UID तथा GID सेट् कर्तुं प्रयतध्वम्

source: In case the server supports the CIFS Unix Extensions, the client side (i.e. your side) attempts to set the effective UID and GID of the current process on newly created files, directories and devices. If this feature is turned off, the server will set the UID and GID to the default for the share. It is recommended that you read the manual page of mount.cifs before you change this setting.
sa: सर्वरः CIFS Unix Extensions समर्थयति इति सन्दर्भे क्लायन्ट् पक्षः (अर्थात् भवतः पक्षः) नवनिर्मितसञ्चिकासु, निर्देशिकासु, उपकरणेषु च वर्तमानप्रक्रियायाः प्रभावी UID तथा GID सेट् कर्तुं प्रयतते यदि एतत् विशेषता निष्क्रियं भवति तर्हि सर्वरः UID तथा GID इत्येतौ भागस्य कृते पूर्वनिर्धारितरूपेण सेट् करिष्यति । एतत् सेटिङ्ग् परिवर्तयितुं पूर्वं mount.cifs इत्यस्य मैनुअल् पृष्ठं पठितुं अनुशंसितम् ।

source: Use server inode numbers
sa: सर्वर inode सङ्ख्यानां उपयोगं कुर्वन्तु

source: Use inode numbers (unique persistent file identifiers) returned by the server instead of automatically generating temporary inode numbers on the client side.
sa: क्लायन्ट् पक्षे स्वयमेव अस्थायी inode सङ्ख्याः जनयितुं स्थाने सर्वरेण प्रत्यागतानां inode सङ्ख्यानां (अद्वितीयस्थायिसञ्चिकापरिचयकानां) उपयोगं कुर्वन्तु ।

source: Do not send byte range lock requests
sa: बाइट्-परिधि-लॉक्-अनुरोधं न प्रेषयन्तु

source: Do not send byte range lock requests to the server. This is necessary for certain applications that break with CIFS style mandatory byte range locks (and most CIFS servers do not yet support requesting advisory byte range locks).
sa: बाइट् रेन्ज लॉक् अनुरोधं सर्वरं प्रति न प्रेषयन्तु । एतत् कतिपयेभ्यः अनुप्रयोगेभ्यः आवश्यकं यत् CIFSशैल्याः अनिवार्यबाइट्-परिधि-तालाभिः सह भङ्गं कुर्वन्ति (तथा च अधिकांशः CIFS-सर्वरः अद्यापि सल्लाहकार-बाइट-परिधि-तालान्-अनुरोधस्य समर्थनं न करोति)

source: Translate reserved characters
sa: आरक्षितवर्णानां अनुवादं कुर्वन्तु

source: Translate six of the seven reserved characters (including the colon, question mark, pipe, asterisk, greater than and less than characters but not the backslash) to remap range (above 0xF000). This allows you to open files that were created with such characters. This has no effect if the server does not support Unicode.
sa: सप्तसु आरक्षितवर्णेषु षट् (कोलन्, प्रश्नचिह्नं, पाइप्, ताराचिह्नं, वर्णात् अधिकं न्यूनं च किन्तु बैकस्लैशं न) पुनः मैप-परिधिं (0xF000 तः उपरि) कृते अनुवादयन्तु एतेन एतादृशैः वर्णैः निर्मिताः सञ्चिकाः उद्घाटयितुं शक्यन्ते । यदि सर्वरः यूनिकोडस्य समर्थनं न करोति तर्हि एतस्य कोऽपि प्रभावः नास्ति ।

source: SMB protocol version:
sa: SMB प्रोटोकॉल संस्करणम् :

source: Define which version of the SMB protocol is to be used.
sa: SMB प्रोटोकॉलस्य कस्य संस्करणस्य उपयोगः करणीयः इति परिभाषयन्तु ।

source: 1.0 (Classic CIFS/SMBv1 protocol)
sa: १.० (क्लासिक् CIFS/SMBv1 प्रोटोकॉल)

source: 2.0 (Windows Vista SP1/Windows Server 2008)
sa: २.० (विण्डोज विस्टा एसपी१/विण्डोज सर्वर २००८)

source: 2.1 (Windows 7/Windows Server 2008R2)
sa: २.१ (विण्डोज ७/विण्डोज सर्वर २००८आर२)

source: 3.0 (Windows 8/Windows Server 2012)
sa: ३.० (विण्डोज ८/विण्डोज सर्वर २०१२)

source: 3.0.2 (Windows 8.1/Windows Server 2012R2)
sa: ३.०.२ (विण्डोज ८.१/विण्डोज सर्वर २०१२आर२)

source: 3.1.1 (Windows Server 2016)
sa: ३.१.१ (विण्डोज सर्वर २०१६)

source: 3 (Version 3.0 and above)
sa: ३ (संस्करणम् ३.० अपि च उपरि)

source: default (Negotiate the highest version)
sa: default (उच्चतमसंस्करणस्य वार्तालापं कुर्वन्तु)

source: Cache mode:
sa: मोड कैश :

source: Define how read and write requests are handled. In case you choose to not cache file data at all, the client never utilizes the cache for normal reads and writes. It always accesses the server directly to satisfy a read or write request. If you choose to follow the CIFS/SMB2 protocol strictly, the cache is only trusted if the client holds an oplock. If the client does not hold an oplock, then the client bypasses the cache and accesses the server directly to satisfy a read or write request. Choosing to allow loose caching semantics can sometimes provide better performance on the expense of cache coherency. This option might cause data corruption, if several clients access the same set of files on the server at the same time. Because of this, the strict cache mode is recommended.
sa: पठन-लेखन-अनुरोधाः कथं नियन्त्रिताः भवन्ति इति परिभाषयन्तु । यदि भवान् सञ्चिकादत्तांशं सर्वथा न संग्रहीतुं चयनं करोति तर्हि क्लायन्ट् सामान्यपठनलेखनयोः कृते कदापि संग्रहणस्य उपयोगं न करोति । पठन-लेखन-अनुरोधं पूरयितुं सर्वदा प्रत्यक्षतया सर्वरं प्राप्नोति । यदि भवान् CIFS/SMB2 प्रोटोकॉलस्य कठोररूपेण अनुसरणं कर्तुं चयनं करोति तर्हि संग्रहणं केवलं तदा एव विश्वसिति यदा क्लायन्ट् oplock धारयति । यदि क्लायन्ट् oplock न धारयति, तर्हि क्लायन्ट् कैशं बाईपास कृत्वा पठन-लेखन-अनुरोधं पूरयितुं प्रत्यक्षतया सर्वरं अभिगच्छति । शिथिल-सञ्चय-शब्दार्थस्य अनुमतिं दातुं चयनं कदाचित् संग्रहण-सङ्गति-व्ययस्य उपरि उत्तमं प्रदर्शनं दातुं शक्नोति । एषः विकल्पः दत्तांशभ्रष्टतां जनयितुं शक्नोति, यदि अनेके क्लायन्ट् एकस्मिन् समये सर्वरे समानसञ्चिकासमूहं प्राप्नुवन्ति । अतः कठोरः cache mode अनुशंसितः अस्ति ।

source: Do not cache file data at all
sa: सञ्चिकादत्तांशं सर्वथा न संग्रहयन्तु

source: Follow the CIFS/SMB2 protocol strictly
sa: CIFS/SMB2 प्रोटोकॉलस्य सख्यं अनुसरणं कुर्वन्तु

source: Allow loose caching semantics
sa: शिथिलं संग्रहणशब्दार्थं अनुमन्यताम्

source: Security mode:
sa: सुरक्षाविधिः :

source: Security mode for mount.cifs. To be able to use this mode, the CIFS kernel module 1.40 or later is required.
sa: mount.cifs कृते सुरक्षाविधिः । एतत् मोड् उपयोक्तुं शक्नुवन् CIFS कर्नेल् मॉड्यूल् १.४० अथवा ततः परं आवश्यकम् ।

source: Connect as a null user (no name)
sa: शून्यप्रयोक्तृरूपेण संयोजयन्तु (नाम नास्ति)

source: Kerberos 5 authentication
sa: केरबेरोस् ५ प्रमाणीकरणम्

source: Kerberos 5 authentication and packet signing
sa: Kerberos 5 प्रमाणीकरणं तथा पैकेट् हस्ताक्षरं च

source: NTLM protocol
sa: एनटीएलएम प्रोटोकॉल

source: NTLM protocol and packet signing
sa: NTLM प्रोटोकॉल तथा पैकेट हस्ताक्षर

source: NTLMv2 protocol
sa: NTLMv2 प्रोटोकॉल

source: NTLMv2 protocol and packet signing
sa: NTLMv2 प्रोटोकॉल तथा पैकेट् हस्ताक्षरम्

source: NTLMSSP protocol
sa: एनटीएलएमएसएसपी प्रोटोकॉल

source: NTLMSSP protocol and packet signing
sa: NTLMSSP प्रोटोकॉल तथा पैकेट हस्ताक्षर

# Open the contents of the share with the file manager
source: Open
sa: उद्घाटित

source: The way Smb4K stores the login credentials has changed. They will now be migrated. This change is incompatible with earlier versions of Smb4K.
sa: Smb4K इत्यनेन प्रवेशप्रमाणपत्राणि यथा संग्रहीतुं शक्यते तत् परिवर्तितम् अस्ति । ते इदानीं प्रवासिताः भविष्यन्ति। एषः परिवर्तनः Smb4K इत्यस्य पूर्वसंस्करणैः सह असङ्गतः अस्ति ।

source: Disk
sa: डिस्क

source: Printer
sa: मुद्रक

source: Synchronizing
sa: समन्वयनम्

source: Source
sa: स्रोतः

source: Destination
sa: गन्तव्य
