Repository: KDE/smb4k
Catalog: po/*/smb4k-core.po
Languages: hi

source: <p>The share <b>%1</b> is mounted to <br><b>%2</b> and owned by user <b>%3</b>.</p><p>Do you really want to unmount it?</p>
hi: <p>शेयर <b>%1</b> को माउंट किया गया है<br> <b>%2</b> और उपयोगकर्ता <b>%3</b> के स्वामित्व में है.</p><p> क्या आप सचमुच इसे अनमाउंट करना चाहते हैं?</p>

source: Foreign Share
hi: विदेशी शेयर

source: User ID:
hi: उपयोगकर्ता पहचान:

source: This is the user ID (a number) that the files and directories of the mounted share will have.
hi: यह उपयोगकर्ता आईडी (एक संख्या) है जो माउंटेड शेयर की फ़ाइलों और निर्देशिकाओं में होगी।

source: Group ID:
hi: समूह आईडी:

source: This is the group ID (a number) that the files and directories of the mounted share will have.
hi: यह समूह आईडी (एक संख्या) है जो माउंटेड शेयर की फ़ाइलों और निर्देशिकाओं में होगी।

source: File mode:
hi: फ़ाइल मोड:

source: This is the file mode that will be used for creating files. It must be defined in octal.
hi: यह वह फ़ाइल मोड है जिसका उपयोग फ़ाइलें बनाने के लिए किया जाएगा। इसे ऑक्टल में परिभाषित किया जाना चाहिए।

source: Directory mode:
hi: निर्देशिका मोड:

source: This is the directory mode that will be used for creating directories. It must be defined in octal.
hi: यह वह डायरेक्टरी मोड है जिसका उपयोग डायरेक्टरी बनाने के लिए किया जाएगा। इसे ऑक्टल में परिभाषित किया जाना चाहिए।

source: Use character sets
hi: वर्ण सेट का उपयोग करें

source: This is the character set that is used by the client side (i.e. your side) for codepage to charset translations. If you keep the default setting, Smb4K will try to automatically determine the charset by looking up the "unix charset" option in the smb.conf.
hi: यह वह वर्ण सेट है जिसका उपयोग क्लाइंट साइड (यानी आपकी साइड) द्वारा कोडपेज से वर्णसेट अनुवाद के लिए किया जाता है। यदि आप डिफ़ॉल्ट सेटिंग रखते हैं, तो Smb4K smb.conf में "unix charset" विकल्प को देखकर स्वचालित रूप से वर्णसेट निर्धारित करने का प्रयास करेगा।

source: Client character set:
hi: क्लाइंट वर्ण सेट:

source: default
hi: गलती करना

source: iso8859-1
hi: आईएसओ8859-1

source: iso8859-2
hi: आईएसओ8859-2

source: iso8859-3
hi: आईएसओ8859-3

source: iso8859-4
hi: आईएसओ8859-4

source: iso8859-5
hi: आईएसओ8859-5

source: iso8859-6
hi: आईएसओ8859-6

source: iso8859-7
hi: आईएसओ8859-7

source: iso8859-8
hi: आईएसओ8859-8

source: iso8859-9
hi: आईएसओ8859-9

source: iso8859-13
hi: आईएसओ8859-13

source: iso8859-14
hi: आईएसओ8859-14

source: iso8859-15
hi: आईएसओ8859-15

source: koi8-r
hi: koi8-आर

source: koi8-u
hi: koi8-यू

source: cp1251
hi: सीपी1251

source: gb2312
hi: जीबी 2312

source: big5
hi: बिग 5

source: euc-jp
hi: ईयूसी-जेपी

source: euc-kr
hi: ईयूसी-केआर

source: tis-620
hi: टिस-620

source: Server character set:
hi: सर्वर वर्ण सेट:

source: This is the character set that is used by the server. If you keep the default setting, Smb4K will try to automatically determine the codepage by looking up the "dos charset" option in the smb.conf file.
hi: यह वह वर्ण सेट है जिसका उपयोग सर्वर द्वारा किया जाता है। यदि आप डिफ़ॉल्ट सेटिंग रखते हैं, तो Smb4K smb.conf फ़ाइल में "dos charset" विकल्प को देखकर स्वचालित रूप से कोडपेज निर्धारित करने का प्रयास करेगा।

source: cp437
hi: सीपी437

source: cp720
hi: सीपी720

source: cp737
hi: सीपी737

source: cp775
hi: सीपी775

source: cp850
hi: सीपी850

source: cp852
hi: सीपी852

source: cp855
hi: सीपी855

source: cp857
hi: सीपी857

source: cp858
hi: सीपी858

source: cp860
hi: सीपी860

source: cp861
hi: सीपी861

source: cp862
hi: सीपी862

source: cp863
hi: सीपी863

source: cp864
hi: सीपी864

source: cp865
hi: सीपी865

source: cp866
hi: सीपी866

source: cp869
hi: सीपी869

source: cp874
hi: सीपी874

source: cp932
hi: सीपी932

source: cp936
hi: सीपी936

source: cp949
hi: सीपी949

source: cp950
hi: सीपी950

source: cp1250
hi: सीपी1250

source: cp1252
hi: सीपी1252

source: cp1253
hi: सीपी1253

source: cp1254
hi: सीपी1254

source: cp1255
hi: सीपी1255

source: cp1256
hi: सीपी1256

source: cp1257
hi: सीपी1257

source: cp1258
hi: सीपी1258

source: unicode
hi: यूनिकोड

source: Mount prefix:
hi: माउंट उपसर्ग:

source: This is the prefix where Smb4K will create the mount points and mount the remote shares.
hi: यह वह उपसर्ग है जहां Smb4K माउंट पॉइंट बनाएगा और दूरस्थ शेयर्स को माउंट करेगा।

source: Force generated subdirectories to be lower case
hi: जनरेट की गई उपनिर्देशिकाओं को लोअर केस में लिखने के लिए बाध्य करें

source: All names of the subdirectories created by Smb4K below the mount prefix will be lowercase.
hi: माउंट उपसर्ग के नीचे Smb4K द्वारा बनाई गई सभी उपनिर्देशिकाओं के नाम लोअरकेस में होंगे।

source: Unmount all personal shares on exit
hi: बाहर निकलते समय सभी व्यक्तिगत शेयर अनमाउंट करें

source: Unmount all shares that belong to you when the program exits. Shares that are owned by other users are ignored.
hi: प्रोग्राम से बाहर निकलने पर अपने सभी शेयर अनमाउंट करें। अन्य उपयोगकर्ताओं के स्वामित्व वाले शेयर अनदेखा कर दिए जाते हैं।

source: Remount shares
hi: रीमाउंट शेयर

source: Remount all your shares that were mounted when you exited the program or changed a profile. If the remounting of a share fails, Smb4K will retry the next time it is started. Shares that were mounted by other users are ignored. Please note that this setting does not affect the automatic remounting of shares when your computer woke up from a sleep state.
hi: अपने सभी शेयर्स को फिर से माउंट करें जो आपके प्रोग्राम से बाहर निकलने या प्रोफ़ाइल बदलने पर माउंट किए गए थे। यदि किसी शेयर को फिर से माउंट करना विफल हो जाता है, तो Smb4K अगली बार शुरू होने पर पुनः प्रयास करेगा। अन्य उपयोगकर्ताओं द्वारा माउंट किए गए शेयर्स को अनदेखा कर दिया जाता है। कृपया ध्यान दें कि यह सेटिंग आपके कंप्यूटर के स्लीप स्टेट से जागने पर शेयर्स के स्वचालित रीमाउंटिंग को प्रभावित नहीं करती है।

source: Number of remount attempts:
hi: पुनः चढ़ने के प्रयासों की संख्या:

source: Set the number of attempts that are made to remount shares before Smb4K gives up.
hi: Smb4K के हार मानने से पहले शेयरों को पुनः माउंट करने के लिए किए जाने वाले प्रयासों की संख्या निर्धारित करें।

source: Interval between remount attempts:
hi: पुनः चढ़ने के प्रयासों के बीच अंतराल:

source: Set the time that elapses between attempts to remount shares.
hi: शेयरों को पुनः माउंट करने के प्रयासों के बीच व्यतीत होने वाला समय निर्धारित करें।

source: Allow the unmounting of shares that are owned by other users
hi: अन्य उपयोगकर्ताओं के स्वामित्व वाले शेयरों को अनमाउंट करने की अनुमति दें

source: Allow the unmounting of shares that were mounted by other users. Please think before you enable this option.
hi: अन्य उपयोगकर्ताओं द्वारा माउंट किए गए शेयरों को अनमाउंट करने की अनुमति दें। कृपया इस विकल्प को सक्षम करने से पहले सोचें।

source: Force the unmounting of inaccessible shares
hi: अप्राप्य शेयरों को अनमाउंट करने के लिए बाध्य करें

source: Force the unmounting of inaccessible shares (Linux only). In case a share is inaccessible, a lazy unmount is performed. Before the actual unmount is performed, a warning dialog is shown asking to approve the unmount.
hi: अप्राप्य शेयरों को अनमाउंट करने के लिए बाध्य करें (केवल लिनक्स)। यदि कोई शेयर अप्राप्य है, तो एक आलसी अनमाउंट किया जाता है। वास्तविक अनमाउंट किए जाने से पहले, एक चेतावनी संवाद दिखाया जाता है जो अनमाउंट को स्वीकृत करने के लिए कहता है।

source: Detect all shares that are mounted on the system
hi: सिस्टम पर माउंट किए गए सभी शेयरों का पता लगाएं

source: You will not only see the shares that were mounted and are owned by you, but also all other mounts using the SMBFS and CIFS file system that are present on the system.
hi: आप न केवल उन शेयरों को देखेंगे जो माउंट किए गए थे और आपके स्वामित्व में हैं, बल्कि सिस्टम पर मौजूद SMBFS और CIFS फ़ाइल सिस्टम का उपयोग करने वाले सभी अन्य माउंट भी देखेंगे।

source: All or most of the servers support the CIFS Unix extensions
hi: सभी या अधिकांश सर्वर CIFS Unix एक्सटेंशन का समर्थन करते हैं

source: Most versions of Samba support the CIFS Unix or POSIX extensions. For these servers, some options are not needed, because the right values are negotiated during the mount process. For other servers, you might want to uncheck this option, so that predefined values can be passed to the server. Please note that if your computer is located in a Windows dominated network neighborhood with only a few Samba servers, you can safely uncheck this option and define custom options for the Samba servers.
hi: सांबा के अधिकांश संस्करण CIFS Unix या POSIX एक्सटेंशन का समर्थन करते हैं। इन सर्वरों के लिए, कुछ विकल्पों की आवश्यकता नहीं है, क्योंकि माउंट प्रक्रिया के दौरान सही मानों पर बातचीत की जाती है। अन्य सर्वरों के लिए, आप इस विकल्प को अनचेक करना चाह सकते हैं, ताकि पूर्वनिर्धारित मान सर्वर को पास किए जा सकें। कृपया ध्यान दें कि यदि आपका कंप्यूटर केवल कुछ सांबा सर्वरों वाले विंडोज वर्चस्व वाले नेटवर्क पड़ोस में स्थित है, तो आप सुरक्षित रूप से इस विकल्प को अनचेक कर सकते हैं और सांबा सर्वरों के लिए कस्टम विकल्प परिभाषित कर सकते हैं।

source: This is the user ID (a number) that the files and directories of the mounted share will have. If you are using the CIFS filesystem under Linux and the remote server supports the CIFS Unix Extensions, this setting will be ignored unless the assignment of the user ID is forced.
hi: यह वह उपयोगकर्ता आईडी (एक संख्या) है जो माउंटेड शेयर की फ़ाइलों और निर्देशिकाओं में होगी। यदि आप Linux के तहत CIFS फ़ाइल सिस्टम का उपयोग कर रहे हैं और रिमोट सर्वर CIFS Unix एक्सटेंशन का समर्थन करता है, तो यह सेटिंग तब तक अनदेखा की जाएगी जब तक कि उपयोगकर्ता आईडी का असाइनमेंट मजबूर न हो।

source: This is the group ID (a number) that the files and directories of the mounted share will have. If you are using the CIFS filesystem under Linux and the remote server supports the CIFS Unix Extensions, this setting will be ignored unless the assignment of the group ID is forced.
hi: यह समूह आईडी (एक संख्या) है जो माउंटेड शेयर की फ़ाइलों और निर्देशिकाओं में होगी। यदि आप लिनक्स के तहत CIFS फ़ाइल सिस्टम का उपयोग कर रहे हैं और रिमोट सर्वर CIFS यूनिक्स एक्सटेंशन का समर्थन करता है, तो इस सेटिंग को तब तक अनदेखा किया जाएगा जब तक कि समूह आईडी का असाइनमेंट मजबूर न हो।

source: This is the file mode that will be used for creating files. It must be defined in octal. In case the CIFS file system is used, this setting only takes effect if the server does not support the CIFS Unix Extensions.
hi: यह वह फ़ाइल मोड है जिसका उपयोग फ़ाइलें बनाने के लिए किया जाएगा। इसे ऑक्टल में परिभाषित किया जाना चाहिए। यदि CIFS फ़ाइल सिस्टम का उपयोग किया जाता है, तो यह सेटिंग केवल तभी प्रभावी होती है जब सर्वर CIFS Unix एक्सटेंशन का समर्थन नहीं करता है।

source: This is the filemode that will be used for creating files. It must be defined in octal. In case the CIFS file system is used, this setting only takes effect if the server does not support the CIFS Unix Extensions.
hi: यह वह फ़ाइल मोड है जिसका उपयोग फ़ाइलें बनाने के लिए किया जाएगा। इसे ऑक्टल में परिभाषित किया जाना चाहिए। यदि CIFS फ़ाइल सिस्टम का उपयोग किया जाता है, तो यह सेटिंग केवल तभी प्रभावी होती है जब सर्वर CIFS Unix एक्सटेंशन का समर्थन नहीं करता है।

source: This is the directory mode that will be used for creating directories. It must be defined in octal. In case the CIFS file system is used, this setting only takes effect if the server does not support the CIFS Unix Extensions.
hi: यह वह डायरेक्टरी मोड है जिसका उपयोग डायरेक्टरी बनाने के लिए किया जाएगा। इसे ऑक्टल में परिभाषित किया जाना चाहिए। यदि CIFS फ़ाइल सिस्टम का उपयोग किया जाता है, तो यह सेटिंग केवल तभी प्रभावी होती है जब सर्वर CIFS Unix एक्सटेंशन का समर्थन नहीं करता है।

source: File system port:
hi: फ़ाइल सिस्टम पोर्ट:

source: This is the port that is exclusively used to mount shares from remote servers. The default value is 445 (CIFS file system).
hi: यह वह पोर्ट है जिसका उपयोग विशेष रूप से रिमोट सर्वर से शेयर माउंट करने के लिए किया जाता है। डिफ़ॉल्ट मान 445 (CIFS फ़ाइल सिस्टम) है।

source: This is the character set that is used by the client side (i.e. your side) either to convert local path names to and from Unicode (CIFS, Linux) or for codepage to charset translations (SMBFS, FreeBSD). If you keep the default setting, Smb4K will try to automatically determine the charset by looking up the "unix charset" option in the smb.conf.
hi: यह वह वर्ण सेट है जिसका उपयोग क्लाइंट साइड (यानी आपकी साइड) द्वारा या तो स्थानीय पथ नामों को यूनिकोड (CIFS, Linux) में बदलने के लिए या कोडपेज से वर्णसेट अनुवाद (SMBFS, FreeBSD) के लिए किया जाता है। यदि आप डिफ़ॉल्ट सेटिंग रखते हैं, तो Smb4K smb.conf में "unix charset" विकल्प को देखकर स्वचालित रूप से वर्णसेट निर्धारित करने का प्रयास करेगा।

source: Write access:
hi: लेखन पहुँच:

source: Here you can choose if the shares should be mounted in read-write or read-only mode.
hi: यहां आप चुन सकते हैं कि शेयरों को पढ़ने-लिखने या केवल पढ़ने के लिए मोड में माउंट किया जाना चाहिए।

source: read-write
hi: पढ़ना-लिखना

source: read-only
hi: केवल पढ़ने के लिए

source: Definitely assign the UID
hi: निश्चित रूप से UID निर्दिष्ट करें

source: Instruct the client (i.e. your side) to ignore any user ID (UID) provided by the server for files and directories and to always assign the owner to be the value of the transmitted UID.
hi: क्लाइंट (अर्थात आपकी ओर से) को निर्देश दें कि वह फ़ाइलों और निर्देशिकाओं के लिए सर्वर द्वारा प्रदान की गई किसी भी उपयोगकर्ता आईडी (UID) को अनदेखा करे तथा स्वामी को हमेशा प्रेषित UID का मान ही निर्दिष्ट करे।

source: Definitely assign the GID
hi: निश्चित रूप से GID असाइन करें

source: Instruct the client (i.e. your side) to ignore any group ID (GID) provided by the server for files and directories and to always assign the owner to be the value of the transmitted GID.
hi: क्लाइंट (अर्थात आपकी साइड) को निर्देश दें कि वह फ़ाइलों और निर्देशिकाओं के लिए सर्वर द्वारा प्रदान की गई किसी भी समूह आईडी (GID) को अनदेखा करे तथा स्वामी को हमेशा प्रेषित GID का मान ही निर्दिष्ट करे।

source: Do permission checks
hi: अनुमति जाँच करें

source: The client side (i.e. your side) will check if you have the right UID/GID to manipulate a file or directory. You might want to switch this feature off if the server(s) support the CIFS Unix Extensions and you are not allowed to access the files and directories. This setting does not affect the normal ACL check.
hi: क्लाइंट साइड (यानी आपकी साइड) यह जांच करेगी कि क्या आपके पास फ़ाइल या निर्देशिका में हेरफेर करने के लिए सही UID/GID है। यदि सर्वर CIFS Unix एक्सटेंशन का समर्थन करता है और आपको फ़ाइलों और निर्देशिकाओं तक पहुँचने की अनुमति नहीं है, तो आप इस सुविधा को बंद करना चाह सकते हैं। यह सेटिंग सामान्य ACL जाँच को प्रभावित नहीं करती है।

source: Attempt to set UID and GID
hi: UID और GID सेट करने का प्रयास करें

source: In case the server supports the CIFS Unix Extensions, the client side (i.e. your side) attempts to set the effective UID and GID of the current process on newly created files, directories and devices. If this feature is turned off, the server will set the UID and GID to the default for the share. It is recommended that you read the manual page of mount.cifs before you change this setting.
hi: यदि सर्वर CIFS Unix एक्सटेंशन का समर्थन करता है, तो क्लाइंट साइड (यानी आपका साइड) नई बनाई गई फ़ाइलों, निर्देशिकाओं और डिवाइस पर वर्तमान प्रक्रिया के प्रभावी UID और GID को सेट करने का प्रयास करता है। यदि यह सुविधा बंद है, तो सर्वर शेयर के लिए UID और GID को डिफ़ॉल्ट पर सेट कर देगा। यह अनुशंसा की जाती है कि आप इस सेटिंग को बदलने से पहले mount.cifs का मैन्युअल पेज पढ़ें।

source: Use server inode numbers
hi: सर्वर इनोड संख्या का उपयोग करें

source: Use inode numbers (unique persistent file identifiers) returned by the server instead of automatically generating temporary inode numbers on the client side.
hi: क्लाइंट साइड पर स्वचालित रूप से अस्थायी इनोड संख्या उत्पन्न करने के बजाय सर्वर द्वारा लौटाए गए इनोड संख्या (अद्वितीय स्थायी फ़ाइल पहचानकर्ता) का उपयोग करें।

source: Do not send byte range lock requests
hi: बाइट रेंज लॉक अनुरोध न भेजें

source: Do not send byte range lock requests to the server. This is necessary for certain applications that break with CIFS style mandatory byte range locks (and most CIFS servers do not yet support requesting advisory byte range locks).
hi: सर्वर को बाइट रेंज लॉक अनुरोध न भेजें। यह कुछ अनुप्रयोगों के लिए आवश्यक है जो CIFS शैली अनिवार्य बाइट रेंज लॉक को तोड़ते हैं (और अधिकांश CIFS सर्वर अभी तक सलाहकार बाइट रेंज लॉक का अनुरोध करने का समर्थन नहीं करते हैं)।

source: Translate reserved characters
hi: आरक्षित वर्णों का अनुवाद करें

source: Translate six of the seven reserved characters (including the colon, question mark, pipe, asterisk, greater than and less than characters but not the backslash) to remap range (above 0xF000). This allows you to open files that were created with such characters. This has no effect if the server does not support Unicode.
hi: सात आरक्षित वर्णों में से छह का अनुवाद करें (कोलन, प्रश्न चिह्न, पाइप, तारांकन चिह्न, इससे बड़ा और इससे छोटा वर्ण लेकिन बैकस्लैश नहीं) ताकि रेंज को रीमैप किया जा सके (0xF000 से ऊपर)। यह आपको ऐसे वर्णों के साथ बनाई गई फ़ाइलों को खोलने की अनुमति देता है। यदि सर्वर यूनिकोड का समर्थन नहीं करता है तो इसका कोई प्रभाव नहीं पड़ता है।

source: SMB protocol version:
hi: एसएमबी प्रोटोकॉल संस्करण:

source: Define which version of the SMB protocol is to be used.
hi: परिभाषित करें कि SMB प्रोटोकॉल का कौन सा संस्करण उपयोग किया जाना है।

source: 1.0 (Classic CIFS/SMBv1 protocol)
hi: 1.0 (क्लासिक CIFS/SMBv1 प्रोटोकॉल)

source: 2.0 (Windows Vista SP1/Windows Server 2008)
hi: 2.0 (विंडोज विस्टा SP1/विंडोज सर्वर 2008)

source: 2.1 (Windows 7/Windows Server 2008R2)
hi: 2.1 (विंडोज 7/विंडोज सर्वर 2008R2)

source: 3.0 (Windows 8/Windows Server 2012)
hi: 3.0 (विंडोज 8/विंडोज सर्वर 2012)

source: 3.0.2 (Windows 8.1/Windows Server 2012R2)
hi: 3.0.2 (विंडोज 8.1/विंडोज सर्वर 2012R2)

source: 3.1.1 (Windows Server 2016)
hi: 3.1.1 (विंडोज सर्वर 2016)

source: 3 (Version 3.0 and above)
hi: 3 (संस्करण 3.0 और ऊपर)

source: default (Negotiate the highest version)
hi: डिफ़ॉल्ट (उच्चतम संस्करण पर बातचीत करें)

source: Cache mode:
hi: मोड कैश:

source: Define how read and write requests are handled. In case you choose to not cache file data at all, the client never utilizes the cache for normal reads and writes. It always accesses the server directly to satisfy a read or write request. If you choose to follow the CIFS/SMB2 protocol strictly, the cache is only trusted if the client holds an oplock. If the client does not hold an oplock, then the client bypasses the cache and accesses the server directly to satisfy a read or write request. Choosing to allow loose caching semantics can sometimes provide better performance on the expense of cache coherency. This option might cause data corruption, if several clients access the same set of files on the server at the same time. Because of this, the strict cache mode is recommended.
hi: परिभाषित करें कि पढ़ने और लिखने के अनुरोधों को कैसे संभाला जाता है। यदि आप फ़ाइल डेटा को बिल्कुल भी कैश नहीं करना चुनते हैं, तो क्लाइंट सामान्य पढ़ने और लिखने के लिए कैश का उपयोग कभी नहीं करता है। यह हमेशा पढ़ने या लिखने के अनुरोध को पूरा करने के लिए सीधे सर्वर तक पहुँचता है। यदि आप CIFS/SMB2 प्रोटोकॉल का सख्ती से पालन करना चुनते हैं, तो कैश केवल तभी विश्वसनीय होता है जब क्लाइंट के पास ऑपलॉक हो। यदि क्लाइंट के पास ऑपलॉक नहीं है, तो क्लाइंट कैश को बायपास कर देता है और पढ़ने या लिखने के अनुरोध को पूरा करने के लिए सीधे सर्वर तक पहुँचता है। ढीले कैशिंग सिमेंटिक्स को अनुमति देने का चयन कभी-कभी कैश सुसंगतता की कीमत पर बेहतर प्रदर्शन प्रदान कर सकता है। यदि कई क्लाइंट एक ही समय में सर्वर पर फ़ाइलों के एक ही सेट तक पहुँचते हैं, तो यह विकल्प डेटा भ्रष्टाचार का कारण बन सकता है। इस वजह से, सख्त कैश मोड की सिफारिश की जाती है।

source: Do not cache file data at all
hi: फ़ाइल डेटा को बिल्कुल भी कैश न करें

source: Follow the CIFS/SMB2 protocol strictly
hi: CIFS/SMB2 प्रोटोकॉल का सख्ती से पालन करें

source: Allow loose caching semantics
hi: ढीले कैशिंग सिमेंटिक्स की अनुमति दें

source: Security mode:
hi: सुरक्षा मोड:

source: Security mode for mount.cifs. To be able to use this mode, the CIFS kernel module 1.40 or later is required.
hi: mount.cifs के लिए सुरक्षा मोड। इस मोड का उपयोग करने में सक्षम होने के लिए, CIFS कर्नेल मॉड्यूल 1.40 या बाद के संस्करण की आवश्यकता है।

source: Connect as a null user (no name)
hi: शून्य उपयोगकर्ता (बिना नाम) के रूप में कनेक्ट करें

source: Kerberos 5 authentication
hi: केर्बेरोस 5 प्रमाणीकरण

source: Kerberos 5 authentication and packet signing
hi: केर्बेरोस 5 प्रमाणीकरण और पैकेट हस्ताक्षर

source: NTLM protocol
hi: एनटीएलएम प्रोटोकॉल

source: NTLM protocol and packet signing
hi: एनटीएलएम प्रोटोकॉल और पैकेट हस्ताक्षर

source: NTLMv2 protocol
hi: एनटीएलएमवी2 प्रोटोकॉल

source: NTLMv2 protocol and packet signing
hi: NTLMv2 प्रोटोकॉल और पैकेट हस्ताक्षर

source: NTLMSSP protocol
hi: एनटीएलएमएसएसपी प्रोटोकॉल

source: NTLMSSP protocol and packet signing
hi: NTLMSSP प्रोटोकॉल और पैकेट हस्ताक्षर

source: Additional options:
hi: अतिरिक्त विकल्प:

source: Here you can enter advanced options for the CIFS file system in a comma-separated list (refer to the manual page of mount.cifs to learn more). The list will be added AS IS to the "-o" argument of mount.cifs. Please do not enter options that have already been defined in the configuration dialog.
hi: यहाँ आप CIFS फ़ाइल सिस्टम के लिए कॉमा से अलग की गई सूची में उन्नत विकल्प दर्ज कर सकते हैं (अधिक जानने के लिए mount.cifs के मैनुअल पेज को देखें)। सूची को mount.cifs के "-o" तर्क में AS IS जोड़ा जाएगा। कृपया कॉन्फ़िगरेशन डायलॉग में पहले से परिभाषित किए गए विकल्प दर्ज न करें।

# Open the contents of the share with the file manager
source: Open
hi: खुला

source: The way Smb4K stores the login credentials has changed. They will now be migrated. This change is incompatible with earlier versions of Smb4K.
hi: Smb4K द्वारा लॉगिन क्रेडेंशियल को संग्रहीत करने का तरीका बदल गया है। अब उन्हें माइग्रेट किया जाएगा। यह परिवर्तन Smb4K के पुराने संस्करणों के साथ असंगत है।

source: Disk
hi: डिस्क

source: Printer
hi: प्रिंटर

source: IPC
hi: भारतीय दंड संहिता

source: Synchronizing
hi: सिंक्रनाइज़ करना

source: Source
hi: स्रोत

source: Destination
hi: गंतव्य
