Repository: KDE/smb4k
Catalog: po/*/smb4k.po
Languages: hi

# NAME OF TRANSLATORS
source: Your names
hi: तुम्हारे नाम

# EMAIL OF TRANSLATORS
source: Your emails
hi: आपके ईमेल

source: The mount process could not be started.
hi: माउंट प्रक्रिया शुरू नहीं की जा सकी.

source: The unmount process could not be started.
hi: अनमाउंट प्रक्रिया शुरू नहीं की जा सकी.

source: Smb4K
hi: एसएमबी4के

source: Advanced network neighborhood browser and Samba share mounting utility
hi: उन्नत नेटवर्क पड़ोस ब्राउज़र और सांबा शेयर माउंटिंग उपयोगिता

source: Alexander Reinholdt
hi: अलेक्जेंडर रेनहोल्ड्ट

source: Developer
hi: डेवलपर

source: Wolfgang Geisendörfer
hi: वोल्फगैंग गीसेन्डोर्फर

source: Donator
hi: दाता

source: &File
hi: &फ़ाइल

source: &Network
hi: &नेटवर्क

source: Sh&ares
hi: शेयर करें

source: &Bookmarks
hi: बुकमार्क

source: &Settings
hi: &सेटिंग्स

source: Main Toolbar
hi: मुख्य टूलबार

source: Bookmark Shares
hi: बुकमार्क शेयर

source: All listed shares will be bookmarked. To add a label or category, double-click the respective bookmark entry.
hi: सभी सूचीबद्ध शेयर बुकमार्क किए जाएँगे। लेबल या श्रेणी जोड़ने के लिए, संबंधित बुकमार्क प्रविष्टि पर डबल-क्लिक करें।

source: Label:
hi: लेबल:

source: Category:
hi: वर्ग:

source: Bookmark Editor
hi: बुकमार्क संपादक

source: Bookmarks
hi: बुकमार्क

source: &Edit Bookmarks
hi: बुकमार्क संपादित करें

source: Add &Bookmark
hi: बुकमार्क जोड़ें

source: Mount Bookmarks
hi: बुकमार्क माउंट करें

source: User Interface
hi: प्रयोक्ता इंटरफ़ेस

source: Network
hi: नेटवर्क

source: Mounting
hi: बढ़ते

source: Synchronization
hi: तुल्यकालन

source: Authentication
hi: प्रमाणीकरण

source: (Profile: %1)
hi: (प्रोफ़ाइल: %1)

source: Custom Settings
hi: कस्टम सेटिंग्स

source: Profiles
hi: प्रोफाइल

source: An incorrect setting has been found. You are now taken to the corresponding configuration page to fix it.
hi: एक गलत सेटिंग पाई गई है। अब आपको इसे ठीक करने के लिए संबंधित कॉन्फ़िगरेशन पेज पर ले जाया जाएगा।

source: You have made changes to the profiles. You have to apply them in order to be able to use them in the rest of the configuration dialog.
hi: आपने प्रोफ़ाइल में बदलाव किए हैं। आपको उन्हें लागू करना होगा ताकि आप उन्हें बाकी कॉन्फ़िगरेशन डायलॉग में इस्तेमाल कर सकें।

source: Default Login
hi: डिफ़ॉल्ट लॉगिन

source: Username:
hi: उपयोगकर्ता नाम:

source: Password:
hi: पासवर्ड:

source: Workgroup:
hi: कार्यसमूह:

source: IP Address:
hi: आईपी पता:

source: Edit
hi: संपादन करना

source: Add Category
hi: श्रेणी जोड़ना

source: Remove
hi: निकालना

source: Clear List
hi: स्पष्ट सूची

source: New Category
hi: नई श्रेणी

source: All fine.
hi: सब ठीक है।

source: The item <b>%1</b> was removed, because all custom settings were reset.
hi: आइटम <b>%1</b> हटा दिया गया, क्योंकि सभी कस्टम सेटिंग्स रीसेट कर दी गई थीं।

source: Behavior
hi: व्यवहार

source: min
hi: मिनट

source: Basic Settings
hi: मूल सेटिंग्स

source: Common Options
hi: सामान्य विकल्प

source: CIFS Unix Extensions Support
hi: CIFS यूनिक्स एक्सटेंशन समर्थन

source: Common Mount Settings
hi: सामान्य माउंट सेटिंग्स

source: Advanced Options
hi: उन्नत विकल्प

source: Advanced Mount Settings
hi: उन्नत माउंट सेटिंग्स

source: Character Sets
hi: वर्ण सेट

source: Mount Settings
hi: माउंट सेटिंग्स

source: Browse Settings
hi: सेटिंग्स ब्राउज़ करें

source: Samba
hi: सांबा

source: Wake-On-LAN
hi: लैन पर जागो

source: s
hi: एस

source: Define the hosts that should be woken up via the custom settings editor.
hi: उन होस्ट्स को परिभाषित करें जिन्हें कस्टम सेटिंग्स संपादक के माध्यम से जगाया जाना चाहिए।

source: Advanced Settings
hi: एडवांस सेटिंग

source: Settings
hi: सेटिंग्स

source: Add
hi: जोड़ना

source: Set Active
hi: सक्रिय सेट करें

source: Move Up
hi: बढ़ाना

source: Move Down
hi: नीचे की ओर

source: Rename
hi: नाम बदलें

source: Synchronization Directory
hi: सिंक्रनाइज़ेशन निर्देशिका

source: Backups
hi: बैकअप

source: General
hi: सामान्य

source: Links
hi: लिंक

source: File Handling
hi: फ़ाइल रखरखाव

source: File Attributes
hi: फ़ाइल विशेषताएँ

source: Ownership
hi: स्वामित्व

source: File Attributes && Ownership
hi: फ़ाइल विशेषताएँ और स्वामित्व

source: Compression
hi: दबाव

source: Files
hi: फ़ाइलें

source: kB
hi: केबी

source: Miscellaneous
hi: मिश्रित

source: kB/s
hi: केबी/एस

source: File Transfer
hi: दस्तावेज हस्तांतरण

source: Files && Directories
hi: फ़ाइलें और निर्देशिकाएँ

source: Restrictions
hi: प्रतिबंध

source: File Deletion
hi: फ़ाइल हटाना

source: General Filtering Settings
hi: सामान्य फ़िल्टरिंग सेटिंग्स

source: Filter Rules
hi: फ़िल्टर नियम

source: Filtering
hi: छनन

source: Checksums
hi: चेकसम

source: Main Window
hi: मुख्य विंडो

source: Network Neighborhood
hi: नेटवर्क पड़ोस

source: Shares View
hi: शेयर देखें

source: Custom Settings Editor
hi: कस्टम सेटिंग्स संपादक

source: No network item was set.
hi: कोई नेटवर्क आइटम सेट नहीं किया गया.

source: Define custom settings for host <b>%1</b> and all the shares it provides.
hi: होस्ट <b>%1</b> और इसके द्वारा प्रदान किए गए सभी शेयरों के लिए कस्टम सेटिंग्स परिभाषित करें।

source: Define custom settings for share <b>%1</b>.
hi: शेयर <b>%1</b> के लिए कस्टम सेटिंग्स परिभाषित करें.

source: Always remount this share
hi: इस शेयर को हमेशा रीमाउंट करें

source: This server supports the CIFS Unix extensions
hi: यह सर्वर CIFS Unix एक्सटेंशन का समर्थन करता है

source: MAC Address:
hi: मैक पता:

source: Send magic packet before scanning the network neighborhood
hi: नेटवर्क पड़ोस को स्कैन करने से पहले जादुई पैकेट भेजें

source: Send magic packet before mounting a share
hi: शेयर माउंट करने से पहले मैजिक पैकेट भेजें

source: Wake-On-LAN Settings
hi: वेक-ऑन-लैन सेटिंग्स

source: Specify User
hi: उपयोगकर्ता निर्दिष्ट करें

source: Please specify a username.
hi: कृपया उपयोगकर्ता नाम निर्दिष्ट करें.

source: Please specify a username for share<br><b>%1</b>.
hi: कृपया साझा करने के लिए उपयोगकर्ता नाम निर्दिष्ट करें<br> <b>%1</b> .

source: Dock Widgets
hi: डॉक विजेट

source: Mounted Shares
hi: माउंटेड शेयर

source: <qt>Closing the main window will keep Smb4K running in the system tray.<br>Use <i>Quit</i> from the <i>File</i> menu to quit the application.</qt>
hi: <qt>मुख्य विंडो बंद करने से सिस्टम ट्रे में Smb4K चलता रहेगा।<br> एप्लिकेशन से बाहर निकलने के लिए <i>फ़ाइल</i> मेनू से <i>क्विट का</i> उपयोग करें।</qt>

source: Docking
hi: डॉकिंग

source: There are currently no shares mounted.
hi: फिलहाल कोई शेयर माउंटेड नहीं है।

source: There is currently %1 share mounted.
hi: वर्तमान में %1 शेयर माउंटेड हैं।

source: Looking for workgroups and domains...
hi: कार्यसमूहों और डोमेन की तलाश में...

source: Looking for hosts in domain %1...
hi: डोमेन %1 में होस्ट खोज रहे हैं...

source: Looking for shares provided by host %1...
hi: होस्ट %1 द्वारा प्रदान किये गए शेयर की तलाश है...

source: Looking for files and directories in %1...
hi: %1 में फ़ाइलें और निर्देशिकाएँ खोज रहा हूँ...

source: Waking up remote hosts...
hi: दूरस्थ होस्ट को जागृत किया जा रहा है...

source: Sending file to printer %1...
hi: फ़ाइल प्रिंटर %1 पर भेजी जा रही है...

source: Searching...
hi: खोज रहा हूँ...

source: Done.
hi: हो गया।

source: Mounting...
hi: बढ़ते...

source: Unmounting...
hi: अनमाउंट किया जा रहा है...

source: Waking up host...
hi: मेजबान जाग रहा है...

source: %1 has been mounted successfully.
hi: %1 सफलतापूर्वक माउंट किया गया है.

source: %1 has been unmounted successfully.
hi: %1 को सफलतापूर्वक अनमाउंट कर दिया गया है.

source: Synchronizing %1
hi: %1 को सिंक्रोनाइज़ किया जा रहा है

source: Mount Dialog
hi: माउंट संवाद

source: Enter the location and optionally the IP address and workgroup to mount a share.
hi: शेयर माउंट करने के लिए स्थान और वैकल्पिक रूप से आईपी पता और कार्यसमूह दर्ज करें।

source: Location:
hi: जगह:

source: Bookmark this share
hi: इस शेयर को बुकमार्क करें

# Bookmark a share in the mount dialog.
source: Bookmark >>
hi: बुकमार्क >>

source: Type
hi: प्रकार

source: IP Address
hi: आईपी पता

source: Comment
hi: टिप्पणी

source: Scan Netwo&rk
hi: नेटवो&आरके स्कैन करें

source: &Abort
hi: &निरस्त करें

source: &Search
hi: &खोज

source: Ctrl+B
hi: Ctrl+बी

source: Add &Custom Settings
hi: कस्टम सेटिंग्स जोड़ें

source: Ctrl+C
hi: Ctrl+सी

source: &Open Mount Dialog
hi: &माउंट संवाद खोलें

source: Ctrl+O
hi: Ctrl+ओ

source: Au&thentication
hi: प्रमाणीकरण

source: Ctrl+T
hi: Ctrl+टी

source: Pre&view
hi: पूर्व दर्शन

source: Ctrl+V
hi: Ctrl+वी

source: &Print File
hi: &फ़ाइल प्रिंट करें

source: Ctrl+P
hi: Ctrl+पी

source: &Mount
hi: &माउंट

source: &Unmount
hi: &अनमाउंट

source: Ctrl+M
hi: Ctrl+एम

source: Scan Compute&r
hi: स्कैन कंप्यूट&r

source: Scan Wo&rkgroup
hi: कार्य समूह को स्कैन करें

source: Ctrl+U
hi: Ctrl+यू

source: Close
hi: बंद करना

source: Search string
hi: खोज स्ट्रिंग

source: Search
hi: खोज

source: Stop
hi: रुकना

source: Item Down
hi: आइटम नीचे

source: Item Up
hi: आइटम ऊपर

source: Clear
hi: स्पष्ट

source: Please enter a username and a password for the host <b>%1</b>.
hi: कृपया होस्ट <b>%1</b> के लिए उपयोगकर्ता नाम और पासवर्ड दर्ज करें।

source: Please enter a username and a password for the share <b>%1</b>.
hi: कृपया शेयर <b>%1</b> के लिए उपयोगकर्ता नाम और पासवर्ड दर्ज करें।

source: Preview Dialog
hi: पूर्वावलोकन संवाद

source: Reload
hi: पुनः लोड करें

source: Abort
hi: बीच में बंद करें

source: Up
hi: ऊपर

source: Preview of %1
hi: %1 का पूर्वावलोकन

source: Print Dialog
hi: संवाद प्रिंट करें

source: Print a file.
hi: फ़ाइल प्रिंट करें.

source: File:
hi: फ़ाइल:

source: Copies:
hi: प्रतियां:

source: Print
hi: छाप

source: Print a file to printer <b>%1</b>.
hi: प्रिंटर <b>%1</b> पर फ़ाइल प्रिंट करें.

source: U&nmount All
hi: सभी को अन&नमाउंट करें

source: Unmount
hi: अनमाउंट

source: Add Bookmark
hi: बुकमार्क जोड़ें

source: Synchronize
hi: सिंक्रनाइज़

source: Open with Konsole
hi: कंसोल के साथ खोलें

source: Open with File Manager
hi: फ़ाइल प्रबंधक के साथ खोलें

source: View Modes
hi: दृश्य मोड

source: Icon View
hi: आइकन दृश्य

source: List View
hi: लिस्ट व्यू

source: Ctrl+N
hi: Ctrl+एन

source: S&ynchronize
hi: सिंक्रनाइज़ करें

source: Open with Konso&le
hi: कंसोल&ले के साथ खोलें

source: Ctrl+L
hi: Ctrl+एल

source: Open with F&ile Manager
hi: फ़ाइल प्रबंधक के साथ खोलें

source: Ctrl+I
hi: Ctrl+आई

source: <qt>There is no active connection to the share <b>%1</b>! You cannot drop any files here.</qt>
hi: <qt>शेयर <b>%1</b> से कोई सक्रिय कनेक्शन नहीं है! आप यहां कोई फ़ाइल नहीं छोड़ सकते।</qt>

source: Source:
hi: स्रोत:

source: Destination:
hi: गंतव्य:

source: Swap Paths
hi: पथ बदलें

source: Please provide the source and destination directory for the synchronization of <b>%1</b>.
hi: कृपया <b>%1</b> के समन्वयन के लिए स्रोत और गंतव्य निर्देशिका प्रदान करें।

source: Type:
hi: प्रकार:

source: DNS-SD Browsing Domain
hi: DNS-SD ब्राउज़िंग डोमेन

source: Workgroup
hi: कार्यसमूह

source: Master Browser:
hi: मास्टर ब्राउज़र:

source: Host
hi: मेज़बान

source: Comment:
hi: टिप्पणी:

source: Share (%1)
hi: शेयर करें (%1)

source: Mounted:
hi: माउंटेड:

source: yes
hi: हाँ

source: no
hi: नहीं

source: Host:
hi: मेज़बान:

source: Mountpoint:
hi: माउंट पॉइंट:

source: unknown
hi: अज्ञात

source: Owner:
hi: मालिक:

source: File system:
hi: फाइल सिस्टम:

source: %1 free of %2 (%3 used)
hi: %1 मुक्त %2 (%3 प्रयुक्त)

source: Size:
hi: आकार:
