Repository: KDE/smb4k
Catalog: po/*/smb4k-core.po
Languages: hi

source: Tab orientation:
hi: टैब अभिविन्यास:

source: Set the tab orientation for the tabified dock widgets.
hi: टैबयुक्त डॉक विजेट के लिए टैब ओरिएंटेशन सेट करें।

source: Top
hi: शीर्ष

source: Bottom
hi: तल

source: Left
hi: बाएं

source: Right
hi: सही

source: Show custom bookmark label if available
hi: यदि उपलब्ध हो तो कस्टम बुकमार्क लेबल दिखाएं

source: Do not show the name of the bookmarked share, but the custom label that was defined in the bookmark editor.
hi: बुकमार्क किए गए शेयर का नाम न दिखाएं, बल्कि बुकमार्क संपादक में परिभाषित किया गया कस्टम लेबल दिखाएं.

source: Start docked
hi: डॉक किया गया प्रारंभ करें

source: Start the application docked to the system tray, i.e. only the system tray widget is shown and the main window is hidden. You can bring the main window up by clicking on the system tray widget or by choosing "Restore" from its popup menu.
hi: सिस्टम ट्रे में डॉक किए गए एप्लिकेशन को शुरू करें, यानी केवल सिस्टम ट्रे विजेट दिखाया गया है और मुख्य विंडो छिपी हुई है। आप सिस्टम ट्रे विजेट पर क्लिक करके या इसके पॉपअप मेनू से "रिस्टोर" चुनकर मुख्य विंडो को ऊपर ला सकते हैं।

source: Show the type of the share
hi: शेयर का प्रकार दिखाएँ

source: The type of a share will be displayed in a separate column in the network neighborhood browser. It can either be Disk, Printer or IPC.
hi: शेयर का प्रकार नेटवर्क नेबरहुड ब्राउज़र में एक अलग कॉलम में प्रदर्शित किया जाएगा। यह डिस्क, प्रिंटर या IPC हो सकता है।

source: Show the IP address of the server
hi: सर्वर का IP पता दिखाएँ

source: The IP address of the server will be displayed in a separate column in the network neighborhood browser.
hi: सर्वर का आईपी पता नेटवर्क नेबरहुड ब्राउज़र में एक अलग कॉलम में प्रदर्शित किया जाएगा।

source: Show the comment
hi: टिप्पणी दिखाएं

source: The comment describing the server or share will be displayed in a separate column in the network neighborhood browser.
hi: सर्वर या शेयर का वर्णन करने वाली टिप्पणी नेटवर्क नेबरहुड ब्राउज़र में एक अलग कॉलम में प्रदर्शित की जाएगी।

source: Show tooltips for network items
hi: नेटवर्क आइटम के लिए टूलटिप्स दिखाएं

source: The tooltip shows various information about the current network item.
hi: टूलटिप वर्तमान नेटवर्क आइटम के बारे में विभिन्न जानकारी दिखाता है।

source: Automatically expand domains and hosts
hi: डोमेन और होस्ट को स्वचालित रूप से विस्तारित करें

source: Automatically expand domain and host items when a list of associated network items (domain members or shares) is added or updated. Please note that a domain or host item will always be expanded when you execute it.
hi: जब संबद्ध नेटवर्क आइटम (डोमेन सदस्य या शेयर) की सूची जोड़ी या अपडेट की जाती है, तो डोमेन और होस्ट आइटम को स्वचालित रूप से विस्तारित करें। कृपया ध्यान दें कि जब आप इसे निष्पादित करते हैं तो डोमेन या होस्ट आइटम हमेशा विस्तारित हो जाएगा।

source: Show tooltips for mounted shares
hi: माउंटेड शेयर के लिए टूलटिप्स दिखाएं

source: The tooltip shows various information about the current share.
hi: टूलटिप वर्तमान शेयर के बारे में विभिन्न जानकारी दिखाता है।

source: View mode:
hi: दृश्य मोड:

source: This setting determines the view mode of the shares view. There are two modes: the icon view and the list view.
hi: यह सेटिंग शेयर दृश्य के दृश्य मोड को निर्धारित करती है। दो मोड हैं: आइकन दृश्य और सूची दृश्य।

source: Icon View
hi: आइकन दृश्य

source: List View
hi: लिस्ट व्यू

source: Icon size for the icon view:
hi: आइकन दृश्य के लिए आइकन आकार:

source: Set the icon size for the icon view mode of the shares view.
hi: शेयर दृश्य के आइकन दृश्य मोड के लिए आइकन आकार सेट करें।

source: Icon size for the list view:
hi: सूची दृश्य के लिए आइकन का आकार:

source: Set the icon size for the list view mode of the shares view.
hi: शेयर दृश्य के सूची दृश्य मोड के लिए आइकन आकार सेट करें.

source: Icon size:
hi: आइकन का आकार:

source: Set the icon size for the network neighborhood browser.
hi: नेटवर्क पड़ोस ब्राउज़र के लिए आइकन आकार सेट करें.

source: Use Web Services Dynamic Discovery (WS-Discovery) for browsing
hi: ब्राउज़िंग के लिए वेब सेवा डायनेमिक डिस्कवरी (WS-Discovery) का उपयोग करें

source: The Web Services Dynamic Discovery (WS-Discovery) is used to browse the local network and discover workgroups, domains and hosts. This is useful, if your network neighborhood is dominated by servers with modern Windows versions. If you use this option, there should be no need to force Samba's client library to use the SMB protocol version 1.0 for searching for workgroups and domains.
hi: वेब सर्विसेज डायनेमिक डिस्कवरी (WS-Discovery) का उपयोग स्थानीय नेटवर्क को ब्राउज़ करने और कार्यसमूहों, डोमेन और होस्ट की खोज करने के लिए किया जाता है। यह उपयोगी है, अगर आपके नेटवर्क पड़ोस में आधुनिक विंडोज संस्करणों वाले सर्वरों का बोलबाला है। यदि आप इस विकल्प का उपयोग करते हैं, तो कार्यसमूहों और डोमेन की खोज के लिए SMB प्रोटोकॉल संस्करण 1.0 का उपयोग करने के लिए Samba की क्लाइंट लाइब्रेरी को बाध्य करने की कोई आवश्यकता नहीं होनी चाहिए।

source: Use DNS Service Discovery (DNS-SD) for browsing
hi: ब्राउज़िंग के लिए DNS सेवा खोज (DNS-SD) का उपयोग करें

source: The DNS Service Discovery (DNS-SD) is used to browse the local network and discover servers that provide shared SMB resources. The discovered domains correspond to the local DNS domains (e. g. named LOCAL) and most likely not the ones defined in the network neighborhood. However, this does not influence the browsing. If you use this option, there is no need to force Samba's client library to use the SMB protocol version 1.0 for searching for workgroups and domains.
hi: DNS सेवा खोज (DNS-SD) का उपयोग स्थानीय नेटवर्क को ब्राउज़ करने और साझा SMB संसाधन प्रदान करने वाले सर्वरों को खोजने के लिए किया जाता है। खोजे गए डोमेन स्थानीय DNS डोमेन (जैसे LOCAL नामित) के अनुरूप होते हैं और संभवतः नेटवर्क पड़ोस में परिभाषित नहीं होते हैं। हालाँकि, यह ब्राउज़िंग को प्रभावित नहीं करता है। यदि आप इस विकल्प का उपयोग करते हैं, तो कार्यसमूहों और डोमेन की खोज के लिए SMB प्रोटोकॉल संस्करण 1.0 का उपयोग करने के लिए Samba की क्लाइंट लाइब्रेरी को बाध्य करने की कोई आवश्यकता नहीं है।

source: Set minimal and maximal SMB protocol version
hi: न्यूनतम और अधिकतम SMB प्रोटोकॉल संस्करण सेट करें

source: Smb4K will set the minimal and maximal SMB protocol version that is used by Samba's client library to browse the network neighborhood. This will overwrite the settings in the smb.conf file. Normally, you do not need to use this option, because the right protocol versions should be negotiated between the client and the server while establishing a connection. Please note that this setting might not be appropriate to make the discovering of workgroups and domains work while keeping undisturbed connectivity to servers. Use DNS Service Discovery (DNS-SD) or Web Services Dynamic Discovery (WS-Discovery) for domain and workgroup lookups instead.
hi: Smb4K न्यूनतम और अधिकतम SMB प्रोटोकॉल संस्करण सेट करेगा जिसका उपयोग नेटवर्क पड़ोस को ब्राउज़ करने के लिए Samba की क्लाइंट लाइब्रेरी द्वारा किया जाता है। यह smb.conf फ़ाइल में सेटिंग्स को अधिलेखित कर देगा। आम तौर पर, आपको इस विकल्प का उपयोग करने की आवश्यकता नहीं होती है, क्योंकि कनेक्शन स्थापित करते समय क्लाइंट और सर्वर के बीच सही प्रोटोकॉल संस्करणों पर बातचीत की जानी चाहिए। कृपया ध्यान दें कि सर्वर से निर्बाध कनेक्टिविटी बनाए रखते हुए कार्यसमूहों और डोमेन की खोज करने के लिए यह सेटिंग उपयुक्त नहीं हो सकती है। इसके बजाय डोमेन और कार्यसमूह लुकअप के लिए DNS सेवा डिस्कवरी (DNS-SD) या वेब सेवा डायनेमिक डिस्कवरी (WS-Discovery) का उपयोग करें।

source: Minimal SMB protocol version:
hi: न्यूनतम SMB प्रोटोकॉल संस्करण:

source: This setting controls the minimum protocol version that Samba's client library will attempt to use.
hi: यह सेटिंग न्यूनतम प्रोटोकॉल संस्करण को नियंत्रित करती है जिसे सांबा की क्लाइंट लाइब्रेरी उपयोग करने का प्रयास करेगी।

source: NT1 (Classic CIFS/SMBv1 protocol)
hi: NT1 (क्लासिक CIFS/SMBv1 प्रोटोकॉल)

source: SMB2 (Windows Vista and above)
hi: SMB2 (विंडोज विस्टा और ऊपर)

source: SMB3 (Windows 8 and above)
hi: SMB3 (विंडोज 8 और ऊपर)

source: Maximal SMB protocol version:
hi: अधिकतम SMB प्रोटोकॉल संस्करण:

source: This setting controls the maximum protocol version that Samba's client library will attempt to use.
hi: यह सेटिंग उस अधिकतम प्रोटोकॉल संस्करण को नियंत्रित करती है जिसे सांबा की क्लाइंट लाइब्रेरी उपयोग करने का प्रयास करेगी।

source: Set the SMB port to:
hi: SMB पोर्ट को इस पर सेट करें:

source: This is the port that is used for connecting to remote servers. The default value is 139 (NetBIOS). Under FreeBSD, this setting is also used for mounting.
hi: यह वह पोर्ट है जिसका उपयोग रिमोट सर्वर से कनेक्ट करने के लिए किया जाता है। डिफ़ॉल्ट मान 139 (NetBIOS) है। FreeBSD के तहत, इस सेटिंग का उपयोग माउंटिंग के लिए भी किया जाता है।

source: This computer is on a large network neighborhood
hi: यह कंप्यूटर एक बड़े नेटवर्क पड़ोस पर है

source: In case your computer is on a large network neighborhood, discovering all workgroups, hosts and shares might take a long time, since in the default configuration all local master browsers are queried. Enabling this setting limits the number of used local master browsers to three. This can reduced the time consumption on large network neighborhoods considerably.
hi: यदि आपका कंप्यूटर किसी बड़े नेटवर्क पड़ोस पर है, तो सभी कार्यसमूहों, होस्ट और शेयरों को खोजने में लंबा समय लग सकता है, क्योंकि डिफ़ॉल्ट कॉन्फ़िगरेशन में सभी स्थानीय मास्टर ब्राउज़र क्वेरी किए जाते हैं। इस सेटिंग को सक्षम करने से उपयोग किए जाने वाले स्थानीय मास्टर ब्राउज़र की संख्या तीन तक सीमित हो जाती है। इससे बड़े नेटवर्क पड़ोस पर समय की खपत काफी कम हो सकती है।

source: Master browsers require authentication
hi: मास्टर ब्राउज़र को प्रमाणीकरण की आवश्यकता होती है

source: The master browsers in your network neighborhood require a login to return the browse list. This setting is rarely needed.
hi: आपके नेटवर्क पड़ोस में मास्टर ब्राउज़र को ब्राउज़ सूची वापस करने के लिए लॉगिन की आवश्यकता होती है। इस सेटिंग की शायद ही कभी ज़रूरत होती है।

source: Use Kerberos for authentication
hi: प्रमाणीकरण के लिए केर्बेरोस का उपयोग करें

source: Use Kerberos for authentication. This is only useful in an Active Directory environment.
hi: प्रमाणीकरण के लिए केर्बेरोस का उपयोग करें। यह केवल एक्टिव डायरेक्ट्री वातावरण में ही उपयोगी है।

source: Use Winbind ccache for authentication
hi: प्रमाणीकरण के लिए Winbind ccache का उपयोग करें

source: Use the Winbind ccache for authentication.
hi: प्रमाणीकरण के लिए Winbind ccache का उपयोग करें।

source: Set the encryption level to:
hi: एन्क्रिप्शन स्तर को इस पर सेट करें:

source: Set the level of encryption that is used for making connections.
hi: कनेक्शन बनाने के लिए उपयोग किए जाने वाले एन्क्रिप्शन का स्तर निर्धारित करें।

source: None
hi: कोई नहीं

source: Request
hi: अनुरोध

source: Require
hi: ज़रूरत होना

source: Preview hidden files and directories
hi: छिपी हुई फ़ाइलों और निर्देशिकाओं का पूर्वावलोकन करें

source: Preview hidden files and directories. The hidden files and directories are those whose names begin with a period. They are usually needed for very specific purposes (storing the configuration information for an application, etc.). Since they are not of any importance for your regular work, you normally do not need to enable this feature.
hi: छिपी हुई फ़ाइलों और निर्देशिकाओं का पूर्वावलोकन करें। छिपी हुई फ़ाइलें और निर्देशिकाएँ वे हैं जिनके नाम एक अवधि से शुरू होते हैं। वे आम तौर पर बहुत विशिष्ट उद्देश्यों (किसी एप्लिकेशन के लिए कॉन्फ़िगरेशन जानकारी संग्रहीत करना, आदि) के लिए आवश्यक हैं। चूँकि वे आपके नियमित काम के लिए कोई महत्व नहीं रखते हैं, इसलिए आपको आमतौर पर इस सुविधा को सक्षम करने की आवश्यकता नहीं है।

source: Detect printer shares
hi: प्रिंटर शेयर का पता लगाएं

source: Printer shares are detected.
hi: प्रिंटर शेयर का पता लगाया गया है.

source: Detect hidden shares
hi: छिपे हुए शेयर का पता लगाएं

source: Hidden shares are detected. Hidden shares are ending with a $ sign, e.g. Musik$ or IPC$.
hi: छिपे हुए शेयर का पता लगाया जाता है। छिपे हुए शेयर $ चिह्न के साथ समाप्त होते हैं, जैसे Musik$ या IPC$.

source: Enable Wake-On-LAN features
hi: वेक-ऑन-लैन सुविधाएँ सक्षम करें

source: Wake-on-LAN (WOL) is an ethernet computer networking standard that allows a computer to be turned on or woken up by a network message. Smb4K uses a magic packet send via a UDP socket to wake up remote servers. If you want to take advantage of the Wake-On-LAN feature, you need to enable this option.
hi: वेक-ऑन-लैन (WOL) एक ईथरनेट कंप्यूटर नेटवर्किंग मानक है जो किसी कंप्यूटर को नेटवर्क संदेश द्वारा चालू या जगाने की अनुमति देता है। Smb4K रिमोट सर्वर को जगाने के लिए UDP सॉकेट के माध्यम से भेजे गए मैजिक पैकेट का उपयोग करता है। यदि आप वेक-ऑन-लैन सुविधा का लाभ उठाना चाहते हैं, तो आपको इस विकल्प को सक्षम करना होगा।

source: Waiting time:
hi: इंतज़ार का समय:

source: This is the waiting time in seconds between the sending of the magic Wake-On-LAN packets and the scanning of the network neighborhood or the mounting of a share.
hi: यह जादुई वेक-ऑन-लैन पैकेटों के भेजे जाने और नेटवर्क पड़ोस की स्कैनिंग या शेयर की माउंटिंग के बीच का सेकण्डों में प्रतीक्षा समय है।

source: Synchronization prefix:
hi: तुल्यकालन उपसर्ग:

source: Under this prefix the destination directory for the synchronization will be created. However, if you want to store the data of a particular share elsewhere, you will be able to choose a different path before the actual synchronization begins.
hi: इस उपसर्ग के अंतर्गत सिंक्रोनाइजेशन के लिए गंतव्य निर्देशिका बनाई जाएगी। हालाँकि, यदि आप किसी विशेष शेयर का डेटा कहीं और संग्रहीत करना चाहते हैं, तो आप वास्तविक सिंक्रोनाइजेशन शुरू होने से पहले एक अलग पथ चुन सकेंगे।

source: Archive mode
hi: संग्रह मोड

source: Use archive mode (-a, --archive). This is a short form of -rlptgoD.
hi: आर्काइव मोड (-a, --archive) का उपयोग करें। यह -rlptgoD का संक्षिप्त रूप है।

source: Recurse into subdirectories
hi: उपनिर्देशिकाओं में पुनरावर्तन करें

source: Recurse into directories (-r, --recursive).
hi: निर्देशिकाओं में पुनरावर्तन (-r, --recursive).

source: Update files
hi: फ़ाइलें अपडेट करें

source: Update files in the destination directory that are older than in the source directory (-u, --update).
hi: गंतव्य निर्देशिका में उन फ़ाइलों को अद्यतन करें जो स्रोत निर्देशिका से पुरानी हैं (-u, --update).

source: Update files in place
hi: फ़ाइलों को यथास्थान अपडेट करें

source: Update destination files in-place (--inplace). By default, rsync first creates a new copy of a file and moves it into place after its transfer finished. If you enable this feature, no copy will be created but the destination file will immediately be overwritten instead. An exception to this is if you combine this option with --backup.
hi: गंतव्य फ़ाइलों को इन-प्लेस अपडेट करें (--inplace)। डिफ़ॉल्ट रूप से, rsync पहले फ़ाइल की एक नई प्रतिलिपि बनाता है और उसके स्थानांतरण समाप्त होने के बाद उसे उसके स्थान पर ले जाता है। यदि आप इस सुविधा को सक्षम करते हैं, तो कोई प्रतिलिपि नहीं बनाई जाएगी, लेकिन गंतव्य फ़ाइल को तुरंत अधिलेखित कर दिया जाएगा। इसका एक अपवाद यह है कि यदि आप इस विकल्प को --backup के साथ जोड़ते हैं।

source: Use relative path names
hi: सापेक्ष पथ नामों का उपयोग करें

source: Use relative paths (-R, --relative). This means that the full path names specified on the command line are sent to the server rather than just the last parts of the file names.
hi: सापेक्ष पथों का उपयोग करें (-R, --relative)। इसका मतलब है कि कमांड लाइन पर निर्दिष्ट पूर्ण पथ नाम सर्वर को भेजे जाते हैं, न कि फ़ाइल नामों के केवल अंतिम भाग।

source: Do not send implied directories
hi: निहित निर्देशिकाएँ न भेजें

source: Do not send implied directories with --relative (--no-implied-dirs). This means that the corresponding path elements on the destination system are left unchanged if they exist, and any missing implied directories are created with default attributes. This even allows these implied path elements to have big differences, such as being a symlink to a directory on one side of the transfer, and a real directory on the other side.
hi: --relative (--no-implied-dirs) के साथ निहित निर्देशिकाएँ न भेजें। इसका मतलब यह है कि गंतव्य सिस्टम पर संगत पथ तत्व अपरिवर्तित रहते हैं यदि वे मौजूद हैं, और कोई भी गुम निहित निर्देशिका डिफ़ॉल्ट विशेषताओं के साथ बनाई जाती है। यह इन निहित पथ तत्वों में बड़े अंतर होने की भी अनुमति देता है, जैसे कि स्थानांतरण के एक तरफ एक निर्देशिका के लिए एक सिमलिंक होना, और दूसरी तरफ एक वास्तविक निर्देशिका होना।

source: Transfer directories without recursing
hi: बिना पुनरावृत्ति के निर्देशिकाओं को स्थानांतरित करें

source: Transfer directories without recursing (-d, --dirs). This means that all top-level subdirectories are transferred but without their contents.
hi: बिना पुनरावृत्ति के निर्देशिकाओं को स्थानांतरित करें (-d, --dirs)। इसका मतलब है कि सभी शीर्ष-स्तरीय उपनिर्देशिकाएँ स्थानांतरित की जाती हैं, लेकिन उनकी सामग्री के बिना।

source: Compress data during transfer
hi: स्थानांतरण के दौरान डेटा संपीड़ित करें

source: Compress data during transfer (-z, --compress). This significantly reduces the amount of data that is being transferred. You may want to use this option, if you have a slow connection.
hi: ट्रांसफर के दौरान डेटा को संपीड़ित करें (-z, --compress)। इससे ट्रांसफर किए जा रहे डेटा की मात्रा में उल्लेखनीय कमी आती है। यदि आपका कनेक्शन धीमा है, तो आप इस विकल्प का उपयोग करना चाह सकते हैं।

source: Set compression level:
hi: संपीड़न स्तर सेट करें:

source: Explicitly set the compression level to use (--compress-level=NUM). If NUM is non-zero, the --compress argument is implied.
hi: उपयोग करने के लिए संपीड़न स्तर को स्पष्ट रूप से सेट करें (--compress-level=NUM)। यदि NUM शून्य नहीं है, तो --compress तर्क निहित है।

source: The value for the UseCompressionLevel config entry
hi: UseCompressionLevel कॉन्फ़िगरेशन प्रविष्टि के लिए मान

source: Skip compression for following file suffixes:
hi: निम्नलिखित फ़ाइल प्रत्ययों के लिए संपीड़न छोड़ें:

source: Overwrite the list of file suffixes that will not be compressed (--skip-compress=LIST). The LIST should be one or more file suffixes (without the dot) separated by slashes. You may specify an empty string to indicate that no file should be skipped. The default list of suffixes will be replaced by this list. For further details, see the manual page of rsync.
hi: उन फ़ाइल प्रत्ययों की सूची को अधिलेखित करें जिन्हें संपीड़ित नहीं किया जाएगा (--skip-compress=LIST)। सूची में एक या अधिक फ़ाइल प्रत्यय (बिना डॉट के) स्लैश द्वारा अलग किए जाने चाहिए। आप यह इंगित करने के लिए एक खाली स्ट्रिंग निर्दिष्ट कर सकते हैं कि कोई फ़ाइल छोड़ी नहीं जानी चाहिए। प्रत्ययों की डिफ़ॉल्ट सूची को इस सूची से बदल दिया जाएगा। अधिक जानकारी के लिए, rsync का मैन्युअल पृष्ठ देखें।

source: The value(s) for the UseSkipCompression config entry
hi: UseSkipCompression कॉन्फ़िगरेशन प्रविष्टि के लिए मान(मान)

source: Preserve symlinks
hi: सिम्बलिंक सुरक्षित रखें

source: Copy symlinks as symlinks (-l, --links).
hi: सिम्बलिंक को सिम्बलिंक (-l, --links) के रूप में कॉपी करें.

source: Transform symlinks
hi: सिम्बलिंक्स को रूपांतरित करें

source: Transform symlinks into the items they are pointing to (-L, --copy-links).
hi: सिम्बोलिक लिंक को उन आइटम में रूपांतरित करें जिनकी ओर वे इंगित कर रहे हैं (-L, --copy-links).

source: Transform unsafe symlinks
hi: असुरक्षित सिम्बलिंक्स को रूपांतरित करें

source: Transform unsafe symlinks into the items they are pointing to (--copy-unsafe-links). This means that only those symlinks are transformed that point to items that are outside the copied tree. Absolute symlinks are treated the same way. This option has no additional effect if --copy-links has also been specified.
hi: असुरक्षित सिम्बलिंक को उन आइटम में बदलें जिनकी ओर वे इशारा कर रहे हैं (--copy-unsafe-links)। इसका मतलब है कि केवल उन सिम्बलिंक को बदला जाता है जो कॉपी किए गए पेड़ के बाहर के आइटम की ओर इशारा करते हैं। निरपेक्ष सिम्बलिंक को उसी तरह से व्यवहार किया जाता है। यदि --copy-links भी निर्दिष्ट किया गया है तो इस विकल्प का कोई अतिरिक्त प्रभाव नहीं है।

source: Ignore unsafe symlinks
hi: असुरक्षित सिम्बलिंक को अनदेखा करें

source: Ignore symlinks that point outside the copied tree (--safe-links). All absolute symlinks are also ignored. If you use this option in conjunction with --relative you might get unexpected results.
hi: कॉपी किए गए ट्री के बाहर इंगित करने वाले सिम्बलिंक को अनदेखा करें (--safe-links)। सभी निरपेक्ष सिम्बलिंक को भी अनदेखा किया जाता है। यदि आप इस विकल्प का उपयोग --relative के साथ करते हैं तो आपको अप्रत्याशित परिणाम मिल सकते हैं।

source: Munge symlinks
hi: मुंगे सिम्बलिंक्स

source: This option tells rsync to (1) modify all symlinks on the receiving side in a way that makes them unusable but recoverable, or (2) to unmunge symlinks on the sending side that had been stored in a munged state (--munge-links). This is useful if you do not quite trust the source of the data to not try to slip in a symlink to an unexpected place. For more details, see the manual page of rsync.
hi: यह विकल्प rsync को (1) प्राप्त करने वाले पक्ष पर सभी सिमलिंक को इस तरह से संशोधित करने के लिए कहता है कि वे अनुपयोगी हो जाएँ लेकिन पुनर्प्राप्त करने योग्य हों, या (2) भेजने वाले पक्ष पर उन सिमलिंक को अनमंज करने के लिए जो एक मंगेड स्थिति (--मंग-लिंक) में संग्रहीत किए गए थे। यह तब उपयोगी होता है जब आपको डेटा के स्रोत पर पूरा भरोसा न हो कि आप किसी अप्रत्याशित स्थान पर सिमलिंक डालने की कोशिश न करें। अधिक जानकारी के लिए, rsync का मैन्युअल पेज देखें।

source: Preserve hard links
hi: हार्ड लिंक सुरक्षित रखें

source: Preserve hard links (-H, --hard-links). This options causes rsync to preserve the hard links that are found during the transfer. Without it, hard links are treated as though they were separate files.
hi: हार्ड लिंक को सुरक्षित रखें (-H, --hard-links)। यह विकल्प rsync को ट्रांसफर के दौरान पाए जाने वाले हार्ड लिंक को सुरक्षित रखने का कारण बनता है। इसके बिना, हार्ड लिंक को इस तरह से माना जाता है जैसे कि वे अलग-अलग फ़ाइलें हों।

source: Copy directory symlinks
hi: निर्देशिका सिम्बलिंक कॉपी करें

source: Treat symlinks to directories on the sending side as though they were real ones (-k, --copy-dirlinks). This is useful if you do not want symlinks to non-directories to be affected, as they would be using --copy-links. Without this option, if the sending side has replaced a directory with a symlink to a directory, the receiving side will delete anything that is in the way of the new symlink, including a directory hierarchy (as long as --force or --delete is in effect). For more details, see the manual page of rsync.
hi: भेजने वाले पक्ष पर निर्देशिकाओं के लिए सिम्बलिंक को ऐसे समझें जैसे कि वे वास्तविक हों (-k, --copy-dirlinks)। यह तब उपयोगी होता है जब आप नहीं चाहते कि गैर-निर्देशिकाओं के सिम्बलिंक प्रभावित हों, क्योंकि वे --copy-links का उपयोग करेंगे। इस विकल्प के बिना, यदि भेजने वाले पक्ष ने किसी निर्देशिका को किसी निर्देशिका के सिम्बलिंक से बदल दिया है, तो प्राप्त करने वाला पक्ष नए सिम्बलिंक के रास्ते में आने वाली किसी भी चीज़ को हटा देगा, जिसमें निर्देशिका पदानुक्रम भी शामिल है (जब तक --force या --delete प्रभावी है)। अधिक जानकारी के लिए, rsync का मैन्युअल पेज देखें।

source: Keep directory symlinks
hi: निर्देशिका सिम्बलिंक रखें

source: Treat symlinks to directories on the receiving side as though they were real ones (-K, --keep-dirlinks). This only works if the symlink matches a real directory from the sending side. Without this option, the receiver's symlink will be deleted and replaced with a real directory.
hi: प्राप्त करने वाले पक्ष पर निर्देशिकाओं के लिए सिम्बलिंक को ऐसे समझें जैसे कि वे वास्तविक हों (-K, --keep-dirlinks)। यह तभी काम करता है जब सिम्बलिंक भेजने वाले पक्ष से वास्तविक निर्देशिका से मेल खाता हो। इस विकल्प के बिना, रिसीवर का सिम्बलिंक हटा दिया जाएगा और उसे वास्तविक निर्देशिका से बदल दिया जाएगा।

source: Preserve permissions
hi: अनुमतियाँ सुरक्षित रखें

source: Preserve permissions (-p, --perms). The permissions of the destination file will be same as the source file. For what happens if this option is switched off, please read rsync's manual page.
hi: अनुमतियाँ सुरक्षित रखें (-p, --perms)। गंतव्य फ़ाइल की अनुमतियाँ स्रोत फ़ाइल के समान ही होंगी। यदि यह विकल्प बंद कर दिया जाए तो क्या होगा, इसके लिए कृपया rsync का मैन्युअल पृष्ठ पढ़ें।
