Repository: KDE/smb4k
Catalog: po/*/smb4k-core.po
Languages: hi

source: Preserve access control lists (ACLs)
hi: एक्सेस नियंत्रण सूची (ACL) को सुरक्षित रखें

source: Preserve access control lists. This option causes rsync to update the destination ACLs to be the same as the source ACLs. The option also implies --perms. The source and destination systems must have compatible ACL entries for this option to work properly.
hi: एक्सेस कंट्रोल सूचियों को सुरक्षित रखें। यह विकल्प rsync को गंतव्य ACL को स्रोत ACL के समान अपडेट करने का कारण बनता है। विकल्प में --perms का भी अर्थ है। इस विकल्प के ठीक से काम करने के लिए स्रोत और गंतव्य सिस्टम में संगत ACL प्रविष्टियाँ होनी चाहिए।

source: Preserve extended attributes
hi: विस्तारित विशेषताओं को संरक्षित करें

source: Preserve extended attributes. This option causes rsync to update the destination extended attributes to be the same as the source ones.
hi: विस्तारित विशेषताओं को संरक्षित करें। यह विकल्प rsync को गंतव्य विस्तारित विशेषताओं को स्रोत विशेषताओं के समान अद्यतन करने का कारण बनता है।

source: Preserve access times
hi: पहुँच समय सुरक्षित रखें

source: Preserve access times. This tells rsync to set the access (use) times of the destination files to the same value as the source files.
hi: पहुँच समय को सुरक्षित रखें। यह rsync को गंतव्य फ़ाइलों के पहुँच (उपयोग) समय को स्रोत फ़ाइलों के समान मान पर सेट करने के लिए कहता है।

source: Preserve create times
hi: निर्माण समय को संरक्षित करें

source: Preserve create times. This tells rsync to set the create times (newness) of the destination files to the same value as the source files.
hi: निर्माण समय को सुरक्षित रखें। यह rsync को गंतव्य फ़ाइलों के निर्माण समय (नवीनता) को स्रोत फ़ाइलों के समान मान पर सेट करने के लिए कहता है।

source: Preserve group
hi: संरक्षित समूह

source: Preserve the group (-g, --group). The group of the destination file will be set to the same value as the source file.
hi: समूह को सुरक्षित रखें (-g, --group): गंतव्य फ़ाइल का समूह स्रोत फ़ाइल के समान मान पर सेट किया जाएगा।

source: Preserve owner
hi: संरक्षित मालिक

source: Preserve the owner (-o, --owner). The owner of the destination file will be set to the same value as the source file, but only if the receiving rsync is run as the super user. Without this option, the owner is set to the invoking user on the receiving side.
hi: स्वामी को सुरक्षित रखें (-o, --owner)। गंतव्य फ़ाइल का स्वामी स्रोत फ़ाइल के समान मान पर सेट किया जाएगा, लेकिन केवल तभी जब प्राप्त करने वाला rsync सुपर उपयोगकर्ता के रूप में चलाया जाता है। इस विकल्प के बिना, स्वामी को प्राप्त करने वाले पक्ष पर इनवोकिंग उपयोगकर्ता पर सेट किया जाता है।

source: Preserve device and special files
hi: डिवाइस और विशेष फ़ाइलों को सुरक्षित रखें

source: Preserve device and special files (-D, --devices --specials). This option causes rsync to transfer character and block devices as well as special files such as named sockets and fifos. It works only partially if rsync is not run as super user and the --super option is not specified.
hi: डिवाइस और विशेष फ़ाइलों को सुरक्षित रखें (-D, --devices --specials)। यह विकल्प rsync को कैरेक्टर और ब्लॉक डिवाइस के साथ-साथ नामित सॉकेट और fifos जैसी विशेष फ़ाइलों को स्थानांतरित करने का कारण बनता है। यह केवल आंशिक रूप से काम करता है यदि rsync को सुपर यूजर के रूप में नहीं चलाया जाता है और --super विकल्प निर्दिष्ट नहीं किया जाता है।

source: Preserve times
hi: समय सुरक्षित रखें

source: Preserve times (-t, --times). The modification times are transferred along with the files. For what happens if this option is switched off, please read rsync's manual page.
hi: समय सुरक्षित रखें (-t, --times)। संशोधन समय फ़ाइलों के साथ स्थानांतरित किया जाता है। यदि यह विकल्प बंद कर दिया जाता है तो क्या होता है, इसके लिए कृपया rsync का मैनुअल पेज पढ़ें।

source: Omit directories when preserving times
hi: समय संरक्षित करते समय निर्देशिकाओं को छोड़ दें

source: Omit directories when preserving times (-O, --omit-dir-times). This means that directories are omitted when modification times are being preserved. Thus, this feature only works in conjunction with --times.
hi: समय को संरक्षित करते समय निर्देशिकाओं को छोड़ दें (-O, --omit-dir-times)। इसका मतलब है कि जब संशोधन समय को संरक्षित किया जा रहा हो तो निर्देशिकाएँ छोड़ दी जाती हैं। इस प्रकार, यह सुविधा केवल --times के साथ मिलकर काम करती है।

source: Remove synchronized source files
hi: सिंक्रनाइज़ स्रोत फ़ाइलें हटाएँ

source: Remove all synchronized source files (--remove-source-files). This tells rsync to remove from the sending side the non-directory items that are a part of the transfer and have been successfully duplicated on the receiving side.
hi: सभी सिंक्रनाइज़ स्रोत फ़ाइलें हटाएँ (--remove-source-files)। यह rsync को भेजने वाले पक्ष से उन गैर-निर्देशिका आइटम को हटाने के लिए कहता है जो स्थानांतरण का हिस्सा हैं और प्राप्त करने वाले पक्ष पर सफलतापूर्वक डुप्लिकेट किए गए हैं।

source: Delete extraneous files
hi: अनावश्यक फ़ाइलें हटाएँ

source: Delete extraneous files from destination (--delete). This tells rsync to delete all files from the receiving side that are not present on the sending side, but only for the directories that are being synchronized.
hi: गंतव्य से बाहरी फ़ाइलें हटाएँ (--delete): यह rsync को प्राप्तकर्ता पक्ष से सभी फ़ाइलों को हटाने के लिए कहता है जो भेजने वाले पक्ष पर मौजूद नहीं हैं, लेकिन केवल उन निर्देशिकाओं के लिए जो सिंक्रनाइज़ की जा रही हैं।

source: Delete files before transfer
hi: स्थानांतरण से पहले फ़ाइलें हटाएँ

source: Delete files on the receiving side before the transfer starts (--delete-before). This is the default behavior if --delete or --delete-excluded is specified without one of the --delete-WHEN options.
hi: स्थानांतरण शुरू होने से पहले प्राप्त करने वाले पक्ष पर फ़ाइलें हटाएँ (--delete-before)। यह डिफ़ॉल्ट व्यवहार है यदि --delete या --delete-excluded को --delete-WHEN विकल्पों में से किसी एक के बिना निर्दिष्ट किया गया है।

source: Delete files after transfer
hi: स्थानांतरण के बाद फ़ाइलें हटाएँ

source: Delete files on the receiving side after the transfer has completed (--delete-after, --del).
hi: स्थानांतरण पूर्ण होने के बाद प्राप्त करने वाले पक्ष की फ़ाइलें हटाएँ (--delete-after, --del).

source: Delete files during transfer
hi: स्थानांतरण के दौरान फ़ाइलें हटाएं

source: Delete files on the receiving side during the transfer (--delete-during). This method is faster than --delete-before or --delete-after, but it is only supported with rsync 2.6.4 or later.
hi: स्थानांतरण के दौरान प्राप्त करने वाले पक्ष पर फ़ाइलें हटाएं (--delete-during)। यह विधि --delete-before या --delete-after से तेज़ है, लेकिन यह केवल rsync 2.6.4 या बाद के संस्करण के साथ समर्थित है।

source: Delete excluded files
hi: बहिष्कृत फ़ाइलें हटाएं

source: Also delete excluded files from destination directory (--delete-excluded). In addition to deleting the files on the receiving side that are not on the sending side, this tells rsync to also delete any files on the receiving side that are excluded. Refer to rsync's manual page for further information.
hi: गंतव्य निर्देशिका से बहिष्कृत फ़ाइलों को भी हटाएँ (--delete-excluded)। प्राप्त करने वाले पक्ष की फ़ाइलों को हटाने के अलावा, जो भेजने वाले पक्ष पर नहीं हैं, यह rsync को प्राप्त करने वाले पक्ष की किसी भी फ़ाइल को हटाने के लिए भी कहता है, जो बहिष्कृत है। अधिक जानकारी के लिए rsync के मैनुअल पेज को देखें।

source: Delete even if I/O errors occur
hi: I/O त्रुटियाँ होने पर भी हटाएँ

source: Delete even if I/O errors occur (--ignore-errors). This option has to be specified in conjunction with --delete to take effect.
hi: I/O त्रुटियाँ होने पर भी हटाएं (--ignore-errors)। प्रभावी होने के लिए इस विकल्प को --delete के साथ निर्दिष्ट किया जाना चाहिए।

source: Force deletion of non-void directories
hi: गैर-शून्य निर्देशिकाओं को बलपूर्वक हटाना

source: Force deletion of directories even if they are not empty (--force). This option tells rsync to delete a non-empty directory when it is to be replaced by a non-directory. This is only relevant if deletions are not active.
hi: निर्देशिकाओं को बलपूर्वक हटाएँ, भले ही वे खाली न हों (--force)। यह विकल्प rsync को बताता है कि जब किसी गैर-खाली निर्देशिका को किसी गैर-निर्देशिका से प्रतिस्थापित किया जाना हो, तो उसे हटा दें। यह केवल तभी प्रासंगिक है जब हटाना सक्रिय न हो।

source: Do not delete more than this many files:
hi: इससे अधिक फ़ाइलें न हटाएँ:

source: Only delete as many files as defined here (--max-delete=NUM). This tells rsync not to delete more than NUM files or directories (NUM must be non-zero). This is useful when mirroring very large trees to prevent disasters.
hi: केवल उतनी ही फ़ाइलें हटाएँ जितनी यहाँ परिभाषित की गई हैं (--max-delete=NUM)। यह rsync को NUM से ज़्यादा फ़ाइलें या निर्देशिकाएँ न हटाने के लिए कहता है (NUM शून्य से ज़्यादा नहीं होनी चाहिए)। यह आपदाओं को रोकने के लिए बहुत बड़े पेड़ों को मिरर करते समय उपयोगी है।

source: Value for DeleteMaximum config entry
hi: DeleteMaximum कॉन्फ़िगरेशन प्रविष्टि के लिए मान

source: Do not transfer any file smaller than:
hi: इससे छोटी कोई भी फ़ाइल स्थानांतरित न करें:

source: This option causes rsync to not transfer any file that is smaller than the specified size (--min-size=SIZE).
hi: यह विकल्प rsync को निर्दिष्ट आकार (--min-size=SIZE) से छोटी किसी भी फ़ाइल को स्थानांतरित नहीं करने देता है।

source: Value for MinimalTransferSize config entry
hi: MinimalTransferSize कॉन्फ़िगरेशन प्रविष्टि के लिए मान

source: Do not transfer any file larger than:
hi: इससे बड़ी कोई भी फ़ाइल स्थानांतरित न करें:

source: This option causes rsync to not transfer any file that is larger than the specified size (--max-size=SIZE).
hi: यह विकल्प rsync को निर्दिष्ट आकार (--max-size=SIZE) से बड़ी किसी भी फ़ाइल को स्थानांतरित नहीं करने देता है।

source: Value for MaximalTransferSize config entry
hi: MaximalTransferSize कॉन्फ़िगरेशन प्रविष्टि के लिए मान

source: Keep partially transferred files
hi: आंशिक रूप से स्थानांतरित फ़ाइलें रखें

source: Keep partially transferred files (--partial). The default behavior is that any partially transferred file is deleted if the transfer is interrupted.
hi: आंशिक रूप से स्थानांतरित फ़ाइलें रखें (--partial)। डिफ़ॉल्ट व्यवहार यह है कि यदि स्थानांतरण बाधित होता है तो आंशिक रूप से स्थानांतरित कोई भी फ़ाइल हटा दी जाती है।

source: Put partially transferred files into:
hi: आंशिक रूप से स्थानांतरित फ़ाइलें यहां रखें:

source: Put a partially transferred file into this directory (--partial-dir=DIR). This is a better way than the --partial option to keep partial files, because the partially transferred file is kept in a different directory and the destination file is not overwritten.
hi: आंशिक रूप से स्थानांतरित फ़ाइल को इस निर्देशिका में रखें (--partial-dir=DIR)। आंशिक फ़ाइलों को रखने के लिए यह --partial विकल्प से बेहतर तरीका है, क्योंकि आंशिक रूप से स्थानांतरित फ़ाइल को एक अलग निर्देशिका में रखा जाता है और गंतव्य फ़ाइल को अधिलेखित नहीं किया जाता है।

source: The data for the UsePartialDirectory option
hi: UsePartialDirectory विकल्प के लिए डेटा

source: Auto-ignore files in the same way CVS does
hi: CVS की तरह ही फ़ाइलों को स्वतः अनदेखा करें

source: Auto-ignore files in the same way CVS does (-C, --cvs-exclude). This is a useful shorthand for excluding a broad range of files that you often do not want to transfer between systems. This option uses the same algorithm that CVS uses to determine if a file should be ignored.
hi: CVS की तरह ही फ़ाइलों को ऑटो-अनदेखा करें (-C, --cvs-exclude)। यह उन फ़ाइलों की एक विस्तृत श्रृंखला को बाहर करने के लिए एक उपयोगी शॉर्टहैंड है जिन्हें आप अक्सर सिस्टम के बीच स्थानांतरित नहीं करना चाहते हैं। यह विकल्प उसी एल्गोरिथ्म का उपयोग करता है जिसका उपयोग CVS यह निर्धारित करने के लिए करता है कि किसी फ़ाइल को अनदेखा किया जाना चाहिए या नहीं।

source: Exclude files matching this pattern:
hi: इस पैटर्न से मेल खाने वाली फ़ाइलें बाहर रखें:

source: Exclude files that match a certain pattern (--exclude=PATTERN). This is a special filter rule. For further information on filter rules see rsync's manual page.
hi: किसी खास पैटर्न से मेल खाने वाली फ़ाइलों को बाहर करें (--exclude=PATTERN)। यह एक विशेष फ़िल्टर नियम है। फ़िल्टर नियमों के बारे में अधिक जानकारी के लिए rsync का मैन्युअल पेज देखें।

source: Pattern that is used for file exclusion
hi: फ़ाइल बहिष्करण के लिए उपयोग किया जाने वाला पैटर्न

source: Read exclude patterns from:
hi: निम्न से बहिष्कृत पैटर्न पढ़ें:

source: Read exclude patterns from a file (--exclude-from=FILE). This option is similar to the --exclude=PATTERN option except that the exclude patterns are read from a file. This is a special filter rule. For further information on filter rules see rsync's manual page.
hi: फ़ाइल से बहिष्कृत पैटर्न पढ़ें (--exclude-from=FILE)। यह विकल्प --exclude=PATTERN विकल्प के समान है, सिवाय इसके कि बहिष्कृत पैटर्न फ़ाइल से पढ़े जाते हैं। यह एक विशेष फ़िल्टर नियम है। फ़िल्टर नियमों के बारे में अधिक जानकारी के लिए rsync का मैन्युअल पेज देखें।

source: The file from which the exclude patterns are read
hi: वह फ़ाइल जिससे बहिष्कृत पैटर्न पढ़े जाते हैं

source: Include files matching this pattern:
hi: इस पैटर्न से मेल खाती फ़ाइलें शामिल करें:

source: Do not exclude files matching a certain pattern (--include=PATTERN). This is a special filter rule. For further information on filter rules see rsync's manual page.
hi: किसी खास पैटर्न (--include=PATTERN) से मेल खाने वाली फ़ाइलों को बाहर न करें। यह एक विशेष फ़िल्टर नियम है। फ़िल्टर नियमों के बारे में अधिक जानकारी के लिए rsync का मैन्युअल पेज देखें।

source: Pattern that is used for file inclusion
hi: फ़ाइल समावेशन के लिए उपयोग किया जाने वाला पैटर्न

source: Read include patterns from:
hi: पढ़ें पैटर्न शामिल हैं:

source: Read include patterns from a file (--include-from=FILE). This option is similar to the --include=PATTERN option except that the include patterns are read from a file. This is a special filter rule. For further information on filter rules see rsync's manual page.
hi: फ़ाइल से शामिल पैटर्न पढ़ें (--include-from=FILE)। यह विकल्प --include=PATTERN विकल्प के समान है, सिवाय इसके कि इसमें शामिल पैटर्न फ़ाइल से पढ़े जाते हैं। यह एक विशेष फ़िल्टर नियम है। फ़िल्टर नियमों के बारे में अधिक जानकारी के लिए rsync का मैन्युअल पेज देखें।

source: The file from which the include patterns are read
hi: वह फ़ाइल जिसमें से सम्मिलित पैटर्न पढ़े जाते हैं

source: Custom filter rules:
hi: कस्टम फ़िल्टर नियम:

source: Add custom file-filtering rules (-f, --filter=RULE). This option allows you to add rules to selectively exclude certain files from the list of files to be transferred. These rules will be added to the rsync command as they are. Thus, each rule has to start with the --filter=... argument.
hi: कस्टम फ़ाइल-फ़िल्टरिंग नियम जोड़ें (-f, --filter=RULE)। यह विकल्प आपको स्थानांतरित की जाने वाली फ़ाइलों की सूची से चुनिंदा फ़ाइलों को बाहर करने के लिए नियम जोड़ने की अनुमति देता है। ये नियम rsync कमांड में वैसे ही जोड़े जाएँगे जैसे वे हैं। इस प्रकार, प्रत्येक नियम को --filter=... तर्क से शुरू करना होगा।

source: Custom filter rules
hi: कस्टम फ़िल्टर नियम

source: Use --filter='dir-merge /.rsync-filter' filter rule
hi: --filter='dir-merge /.rsync-filter' फ़िल्टर नियम का उपयोग करें

source: This filter rule tells rsync to look for per-directory .rsync-filter files that have been sprinkled through the hierarchy and use their rules to filter the files in the transfer. It has no effect, if you also choose to use the --filter='exclude .rsync-filter' rule.
hi: यह फ़िल्टर नियम rsync को प्रति-निर्देशिका .rsync-फ़िल्टर फ़ाइलों को देखने के लिए कहता है जिन्हें पदानुक्रम के माध्यम से छिड़का गया है और स्थानांतरण में फ़ाइलों को फ़िल्टर करने के लिए उनके नियमों का उपयोग करता है। यदि आप --filter='exclude .rsync-filter' नियम का उपयोग करना चुनते हैं, तो इसका कोई प्रभाव नहीं पड़ता है।

source: Use --filter='exclude .rsync-filter' filter rule
hi: --filter='exclude .rsync-filter' फ़िल्टर नियम का उपयोग करें

source: This rule filters out the .rsync-filter files from the transfer. These files normally contain filter rules that can be activated by choosing the --filter='dir-merge /.rsync-filter' rule and deselecting this one.
hi: यह नियम .rsync-filter फ़ाइलों को स्थानांतरण से फ़िल्टर करता है। इन फ़ाइलों में आम तौर पर फ़िल्टर नियम होते हैं जिन्हें --filter='dir-merge /.rsync-filter' नियम चुनकर और इसे अचयनित करके सक्रिय किया जा सकता है।

source: Handle sparse files efficiently
hi: विरल फ़ाइलों को कुशलतापूर्वक संभालें

source: Handle sparse files efficiently (-S, --sparse) so that they take up less space on the destination. This option conflicts with --inplace. For further information read rsync's manual page.
hi: विरल फ़ाइलों को कुशलतापूर्वक संभालें (-S, --sparse) ताकि वे गंतव्य पर कम स्थान लें। यह विकल्प --inplace के साथ टकराव करता है। अधिक जानकारी के लिए rsync का मैनुअल पेज पढ़ें।

source: Copy files whole (no rsync algorithm)
hi: संपूर्ण फ़ाइलें कॉपी करें (कोई rsync एल्गोरिथ्म नहीं)

source: Copy files whole (-W, --whole-file). With this option the incremental rsync algorithm is not used and the whole file is sent as-is instead.
hi: संपूर्ण फ़ाइल की प्रतिलिपि बनाएँ (-W, --whole-file)। इस विकल्प के साथ वृद्धिशील rsync एल्गोरिथ्म का उपयोग नहीं किया जाता है और इसके बजाय संपूर्ण फ़ाइल को उसी रूप में भेजा जाता है।

source: Do not cross file system boundaries
hi: फ़ाइल सिस्टम की सीमाओं को पार न करें

source: Do not cross file system boundaries (-x, --one-file-system). This tells rsync to avoid crossing a filesystem boundary when recursing. For further information on this option, read the manual page.
hi: फ़ाइल सिस्टम की सीमाएँ पार न करें (-x, --one-file-system)। यह rsync को बताता है कि रिकर्सिंग करते समय फ़ाइल सिस्टम की सीमा पार न करें। इस विकल्प के बारे में अधिक जानकारी के लिए, मैनुअल पेज पढ़ें।

source: Only update files that already exist
hi: केवल पहले से मौजूद फ़ाइलों को अपडेट करें

source: Skip creating new files on the receiving side (--existing). This tells rsync to skip creating files (including directories) that do not exist yet on the destination. If this option is combined with the --ignore-existing option, no files will be updated (which can be useful if all you want to do is to delete extraneous files).
hi: प्राप्त करने वाले पक्ष पर नई फ़ाइलें बनाना छोड़ें (--existing)। यह rsync को उन फ़ाइलों (निर्देशिकाओं सहित) को बनाना छोड़ने के लिए कहता है जो अभी तक गंतव्य पर मौजूद नहीं हैं। यदि इस विकल्प को --ignore-existing विकल्प के साथ जोड़ा जाता है, तो कोई भी फ़ाइल अपडेट नहीं की जाएगी (जो तब उपयोगी हो सकती है जब आप केवल बाहरी फ़ाइलों को हटाना चाहते हैं)।

source: Ignore files that already exist
hi: पहले से मौजूद फ़ाइलों को अनदेखा करें

source: Skip updating files that already exist on the receiving side (--ignore-existing). Existing directories are not ignored.
hi: प्राप्त करने वाले पक्ष पर पहले से मौजूद फ़ाइलों को अपडेट करना छोड़ दें (--ignore-existing)। मौजूदा निर्देशिकाओं को अनदेखा नहीं किया जाता है।

source: Delay updates until the end of transfer
hi: स्थानांतरण के अंत तक अपडेट में देरी करें

source: Delay updates until the end of the transfer (--delay-updates). This option puts the temporary file from each updated file into a holding directory until the end of the transfer, at which time all the files are renamed and copied into place in rapid succession.
hi: स्थानांतरण के अंत तक अद्यतनों को विलंबित करें (--delay-updates)। यह विकल्प प्रत्येक अद्यतन की गई फ़ाइल से अस्थायी फ़ाइल को स्थानांतरण के अंत तक होल्डिंग निर्देशिका में रखता है, जिस समय सभी फ़ाइलों का नाम बदल दिया जाता है और उन्हें तेजी से क्रम में कॉपी किया जाता है।

source: Make backups
hi: बैकअप बनाएं

source: Make backups (-b, --backup). With this option, preexisting destination files are renamed as each file is transferred or deleted. You can control where the backup file goes and what (if any) suffix gets appended using the --backup-dir=DIR and --suffix=SUFFIX options.
hi: बैकअप बनाएं (-b, --backup)। इस विकल्प के साथ, प्रत्येक फ़ाइल के स्थानांतरित या हटाए जाने पर पहले से मौजूद गंतव्य फ़ाइलों का नाम बदल दिया जाता है। आप --backup-dir=DIR और --suffix=SUFFIX विकल्पों का उपयोग करके नियंत्रित कर सकते हैं कि बैकअप फ़ाइल कहाँ जाती है और कौन सा (यदि कोई है) प्रत्यय जोड़ा जाता है।

source: Backup suffix:
hi: बैकअप प्रत्यय:

source: Use this suffix for backups (--suffix=SUFFIX).
hi: बैकअप के लिए इस प्रत्यय का उपयोग करें (--suffix=SUFFIX).

source: Backup suffix
hi: बैकअप प्रत्यय

source: Backup directory:
hi: बैकअप निर्देशिका:

source: Store backups in this directory (--backup-dir=DIR).
hi: बैकअप को इस निर्देशिका में संग्रहीत करें (--backup-dir=DIR).

source: Backup directory
hi: बैकअप निर्देशिका

source: Force fixed checksum block size:
hi: चेकसम ब्लॉक आकार को निश्चित करें:

source: Force a fixed checksum block-size (-B, --block-size=SIZE). This forces the block size used in the rsync algorithm to a fixed value.
hi: एक निश्चित चेकसम ब्लॉक-साइज़ (-B, --block-size=SIZE) को बाध्य करें। यह rsync एल्गोरिथ्म में उपयोग किए जाने वाले ब्लॉक आकार को एक निश्चित मान पर बाध्य करता है।

source: The block size
hi: ब्लॉक का आकार

source: Set block/file checksum seed:
hi: ब्लॉक/फ़ाइल चेकसम बीज सेट करें:

source: Set block/file checksum seed (--checksum-seed=NUM). Set the MD4 checksum seed to this integer. This 4 byte checksum seed is included in each block and file MD4 checksum calculation. By default the checksum seed is generated by the server and defaults to the current time.
hi: ब्लॉक/फ़ाइल चेकसम सीड (--checksum-seed=NUM) सेट करें। MD4 चेकसम सीड को इस पूर्णांक पर सेट करें। यह 4 बाइट चेकसम सीड प्रत्येक ब्लॉक और फ़ाइल MD4 चेकसम गणना में शामिल है। डिफ़ॉल्ट रूप से चेकसम सीड सर्वर द्वारा जेनरेट किया जाता है और वर्तमान समय पर डिफ़ॉल्ट होता है।

source: The value for the UseChecksumSeed config option
hi: UseChecksumSeed कॉन्फ़िगरेशन विकल्प के लिए मान

source: Skip files based on checksum
hi: चेकसम के आधार पर फ़ाइलें छोड़ें

source: Skip files based on a checksum and not based on modification time and size (-c, --checksum). For further information on how this feature works read rsync's manual page.
hi: चेकसम के आधार पर फ़ाइलों को छोड़ें, संशोधन समय और आकार के आधार पर नहीं (-c, --checksum)। यह सुविधा कैसे काम करती है, इस बारे में अधिक जानकारी के लिए rsync का मैनुअल पेज पढ़ें।

source: Set bandwidth limit:
hi: बैंडविड्थ सीमा निर्धारित करें:

source: Set the maximum data transfer rate in kilobytes per second (--bwlimit=RATE).
hi: किलोबाइट प्रति सेकंड में अधिकतम डेटा स्थानांतरण दर निर्धारित करें (--bwlimit=RATE).

source: The value for the UseBandwidthLimit config option
hi: UseBandwidthLimit कॉन्फ़िगरेशन विकल्प के लिए मान

source: Use profiles
hi: प्रोफाइल का उपयोग करें

source: Make Smb4K use profiles. This enables you to define different bookmarks and custom options for each profile. This is especially useful if you are using a laptop in different network neighborhoods, e. g. at home and at work.
hi: Smb4K को प्रोफाइल का उपयोग करने दें। यह आपको प्रत्येक प्रोफाइल के लिए अलग-अलग बुकमार्क और कस्टम विकल्प परिभाषित करने में सक्षम बनाता है। यह विशेष रूप से तब उपयोगी होता है जब आप अलग-अलग नेटवर्क पड़ोस में लैपटॉप का उपयोग कर रहे हों, जैसे कि घर पर और काम पर।

source: Profiles
hi: प्रोफाइल

source: The list of profiles.
hi: प्रोफाइल की सूची.

# default profile name for use at home
source: Home
hi: घर

# default profile name for use at work
source: Work
hi: काम

source: Active profile
hi: सक्रिय प्रोफ़ाइल

source: This is the currently active profile.
hi: यह वर्तमान में सक्रिय प्रोफ़ाइल है.

source: %1 on %2
hi: %1 पर %2

source: The format of %1 is not supported.
hi: %1 का प्रारूप समर्थित नहीं है.

source: The file %1 could not be read
hi: फ़ाइल %1 पढ़ी नहीं जा सकी

source: The file %1 could not be printed to %2
hi: फ़ाइल %1 को %2 पर प्रिंट नहीं किया जा सका

source: The Zeroconf daemon is not running. No servers are discovered using DNS-SD.
hi: Zeroconf डेमॉन नहीं चल रहा है। DNS-SD का उपयोग करके कोई सर्वर नहीं खोजा गया है।

source: Zeroconf support is not available in this version of KDE.
hi: KDE के इस संस्करण में Zeroconf समर्थन उपलब्ध नहीं है।

source: An unknown error with Zeroconf occurred.
hi: Zeroconf में एक अज्ञात त्रुटि घटित हुई.
